<pad>	0
<s>	0
</s>	0
<unk>	0
\	-1.97933
n	-2.91562
▁to	-3.49126
▁=	-3.53659
_._	-3.86212
▁n	-3.92555
[	-3.94572
▁a	-3.96495
▁is	-4.07269
▁0	-4.1159
▁i	-4.13422
]	-4.17087
i	-4.19595
▁and	-4.20597
nif	-4.2197
▁1	-4.38938
nprint	-4.45146
▁of	-4.50417
nfor	-4.5445
▁s	-4.62305
nread	-4.63446
▁-	-4.7348
▁+	-4.74994
▁integer	-4.78845
▁long	-4.7951
▁b	-4.80879
▁x	-4.89788
nset	-4.90842
▁with	-4.9555
nelse	-4.97844
▁exclusive	-5.03626
▁m	-5.12469
▁ans	-5.18397
▁	-5.18864
▁c	-5.20953
▁k	-5.22463
▁the	-5.25875
▁(	-5.27273
1	-5.32632
▁than	-5.33611
▁equal	-5.34553
▁j	-5.40678
▁"	-5.40797
▁*	-5.41335
2	-5.45715
▁2	-5.47379
ncreate	-5.47631
▁by	-5.50867
▁int	-5.51778
▁t	-5.52662
j	-5.54952
▁y	-5.55402
)	-5.61394
▁integers	-5.68901
nincrement	-5.7232
▁from	-5.73246
▁size	-5.76231
▁/	-5.7655
▁sum	-5.779
▁be	-5.82078
▁inclusive	-5.8295
▁if	-5.83603
ndeclare	-5.85664
▁newline	-5.89049
▁print	-5.89519
▁array	-5.90617
▁value	-5.91544
▁new	-5.91565
▁d	-5.92541
nlet	-5.9258
▁p	-5.93237
▁greater	-5.95808
a	-5.97628
▁or	-5.99666
▁set	-5.99839
,	-6.00249
▁l	-6.04878
▁read	-6.05328
▁less	-6.06304
(	-6.09194
▁v	-6.11397
▁r	-6.11402
▁increment	-6.11809
nwhile	-6.12174
"\	-6.15187
▁not	-6.19764
▁string	-6.21733
s	-6.22054
▁loop	-6.25187
][	-6.2932
=	-6.318
▁cnt	-6.33031
▁'	-6.34134
"	-6.35096
_	-6.35096
▁true	-6.3518
x	-6.35431
▁arr	-6.35735
▁create	-6.3949
▁line	-6.42084
▁%	-6.45022
▁return	-6.48332
▁then	-6.50023
▁length	-6.55492
[0]	-6.55534
=0	-6.56671
▁do	-6.56952
d	-6.57235
▁f	-6.57554
▁3	-6.59187
▁0_._	-6.59765
nreturn	-6.60938
▁input	-6.62759
▁1]	-6.65523
ing	-6.66308
b	-6.674
▁flag	-6.69079
▁max	-6.70949
▁function	-6.71818
▁10	-6.73531
▁following	-6.74485
▁min	-6.74852
▁num	-6.76358
▁str	-6.76412
assign	-6.77688
▁count	-6.7829
k	-6.7882
▁modulo	-6.809
▁res	-6.82196
1_._	-6.83418
t	-6.86247
3	-6.87153
▁1)	-6.8731
▁temp	-6.90509
▁declare	-6.91499
▁let	-6.91703
▁q	-6.92603
▁variable	-6.92605
▁-1	-6.94282
▁>	-6.95817
'	-6.98092
▁false	-6.98318
[1]	-6.99541
increase	-7.00313
▁mod	-7.02288
y	-7.03017
nadd	-7.0383
ndecrement	-7.04349
▁4	-7.05064
.	-7.07431
▁as	-7.1163
e	-7.11994
▁<	-7.1327
▁<=	-7.14951
▁equals	-7.15096
▁character	-7.16796
NO	-7.18617
m	-7.19121
nbreak	-7.20581
▁in	-7.21043
▁z	-7.2128
▁>=	-7.21481
▁5	-7.22195
nchange	-7.22571
▁w	-7.22723
▁h	-7.22797
▁)	-7.23259
c	-7.2467
▁result	-7.24849
'\	-7.25582
▁vector	-7.3212
▁1_._	-7.32142
▁elements	-7.33047
YES	-7.33244
▁one	-7.33393
▁arguments	-7.36271
▁element	-7.38847
▁N	-7.40557
o	-7.4135
▁for	-7.42026
nsort	-7.4243
f	-7.43087
()	-7.43405
▁len	-7.44031
r	-7.4421
▁end	-7.45238
p	-7.46126
l	-7.47933
▁ch	-7.48158
▁ints	-7.48313
▁!=	-7.49549
na	-7.49755
=1	-7.50772
2_._	-7.50892
▁dp	-7.51511
▁A	-7.54579
nans	-7.55408
▁7	-7.56281
▁at	-7.58568
▁values	-7.59027
nin	-7.60543
▁u	-7.63391
▁e	-7.63702
▁call	-7.66068
-	-7.66817
▁longs	-7.67456
▁g	-7.68582
▁tmp	-7.69198
[2]	-7.70343
ns	-7.72697
call	-7.73374
▁while	-7.7404
▁output	-7.74094
▁boolean	-7.75103
▁are	-7.75432
nloop	-7.76549
▁standar	-7.76976
▁NO	-7.78342
▁_._	-7.79093
▁argument	-7.80056
▁mx	-7.80187
▁strings	-7.80812
int	-7.81047
▁decrement	-7.81219
▁change	-7.82557
▁mp	-7.83681
▁absolute	-7.84669
▁YES	-7.84983
nmake	-7.8522
ed	-7.87869
▁run	-7.88756
▁first	-7.88874
▁variables	-7.88892
▁an	-7.89815
▁char	-7.9098
0	-7.91554
size	-7.92416
v	-7.936
▁2)	-7.94478
Read	-7.94831
▁8	-7.94866
noutput	-7.95477
▁add	-7.96158
▁6	-7.96284
▁constant	-7.98423
])	-7.99796
▁&	-8.021
▁abs	-8.02352
▁'0'	-8.02611
▁it	-8.04643
▁minimum	-8.05053
▁pos	-8.05289
▁st	-8.05647
▁gcd	-8.05955
▁break	-8.06449
ndisplay	-8.07345
]_._	-8.08368
▁index	-8.09809
-1]	-8.09845
▁even	-8.10245
1[	-8.10719
▁else	-8.111
nx	-8.12846
+	-8.14655
▁100	-8.15323
decrease	-8.17513
▁maximum	-8.1786
▁vis	-8.18147
▁check	-8.19808
▁S	-8.20217
▁((	-8.24901
▁maxn	-8.25908
▁arrays	-8.26547
▁name	-8.2687
[3]	-8.27023
-1	-8.28489
to	-8.31447
nappend	-8.31586
nc	-8.32412
nt	-8.32999
ndefine	-8.33208
▁double	-8.33842
▁total	-8.34792
▁on	-8.35055
▁T	-8.3514
▁bool	-8.35284
▁ok	-8.35313
▁start	-8.35482
▁that	-8.35604
u	-8.35651
▁all	-8.35829
ans	-8.35986
A	-8.36718
▁ar	-8.37338
nstart	-8.37528
▁B	-8.38111
▁user	-8.38132
nsum	-8.38803
+1]	-8.39055
2[	-8.39338
▁M	-8.39555
▁map	-8.39941
&	-8.41247
▁decrementing	-8.41902
▁last	-8.42661
▁o	-8.43713
▁val	-8.43817
integers	-8.44191
▁cur	-8.44397
npush	-8.44814
sum	-8.45208
]]	-8.45991
▁mid	-8.46554
*	-8.48777
+1	-8.50418
9	-8.50472
▁now	-8.50479
'_._	-8.50803
▁1][	-8.51264
][0]	-8.52632
▁1000	-8.53071
▁solve	-8.53169
z	-8.53206
h	-8.53379
▁iteration	-8.54171
▁characters	-8.57244
nstop	-8.57487
▁assign	-8.57899
integer	-8.5948
))	-8.61922
▁times	-8.62131
▁increase	-8.62189
▁2_._	-8.62334
O	-8.62501
R	-8.62945
▁MOD	-8.63257
"_._	-8.63724
▁second	-8.63965
into	-8.64181
▁0)	-8.64414
▁odd	-8.64778
D	-8.66398
▁bitwise	-8.66814
▁tak	-8.67064
▁L	-8.67238
max	-8.67758
min	-8.68092
2)	-8.68127
▁'\	-8.68339
▁-1_._	-8.6861
subtract	-8.69718
▁each	-8.69733
▁dfs	-8.70004
▁counter	-8.70574
array	-8.70632
][1]	-8.71008
].	-8.71273
length	-8.71376
▁ret	-8.715
ninput	-8.7316
▁const	-8.73528
nb	-8.73538
▁R	-8.74768
▁void	-8.74769
first	-8.75038
▁right	-8.75721
▁both	-8.76373
▁C	-8.76925
q	-8.76968
ninsert	-8.77064
▁takes	-8.77229
']	-8.77481
second	-8.77528
▁ss	-8.77626
▁left	-8.77675
▁'1'	-8.77855
nd	-8.78069
▁26	-8.7822
▁9	-8.79275
▁truthy	-8.79486
long	-8.79906
nthe	-8.80938
▁105	-8.8096
ncontinue	-8.81338
B	-8.81381
np	-8.821
ndivide	-8.82276
▁maxx	-8.82456
notherwise	-8.82861
▁prime	-8.82882
▁space	-8.83701
)_._	-8.83712
4	-8.86744
▁"\	-8.86874
▁out	-8.88535
▁pointer	-8.88718
▁next	-8.8879
1,	-8.89567
nflag	-8.89993
nm	-8.90691
[4]	-8.9078
▁make	-8.9138
/	-8.91895
LL	-8.91965
▁"_._	-8.92289
▁casted	-8.92605
▁between	-8.93278
▁reading	-8.94194
3_._	-8.9474
arr	-8.96344
▁xx	-8.96563
<	-8.97137
▁continue	-8.98435
nl	-8.98549
▁D	-8.98655
▁swap	-8.99017
▁initialize	-8.99606
▁different	-9.00818
▁bytes	-9.00863
▁cont	-9.01483
▁MAX	-9.02017
L	-9.02209
w	-9.02267
▁beginning	-9.03066
cnt	-9.03274
>	-9.03387
▁K	-9.0356
S	-9.03718
▁mn	-9.04007
1)	-9.04081
▁101	-9.05984
▁no	-9.06344
▁ma	-9.07458
▁vec	-9.07771
▁==	-9.08098
▁row	-9.08111
▁time	-9.0821
narr	-9.08802
nrun	-9.10257
▁minn	-9.10715
num	-9.11012
function	-9.11091
g	-9.11256
string	-9.1135
▁maxi	-9.11707
nend	-9.1242
nk	-9.12663
▁down	-9.12961
▁'-'	-9.134
▁aux	-9.13936
th	-9.14214
str	-9.14448
MAX	-9.14964
end	-9.14982
▁two	-9.1547
crementing	-9.15823
▁'*'	-9.15851
▁INT	-9.15896
▁1))	-9.16039
▁number	-9.16096
▁12	-9.16824
▁sizeof	-9.16928
▁<<	-9.1887
/2	-9.20245
▁empty	-9.20587
▁P	-9.2075
▁current	-9.20803
▁cost	-9.21817
▁20	-9.21824
ncnt	-9.2235
nres	-9.22578
"]	-9.22729
nremove	-9.24451
nv	-9.24703
▁INF	-9.24829
▁substring	-9.24896
pos	-9.25199
ni	-9.25493
▁60	-9.26722
;	-9.26871
["	-9.27341
▁ct	-9.27563
▁answer	-9.27743
▁'.'	-9.27992
▁tot	-9.28607
▁position	-9.2869
▁"0"	-9.29115
ninteger	-9.29124
len	-9.29353
▁col	-9.29358
begin	-9.29724
▁zero	-9.30702
▁mark	-9.30907
▁insert	-9.31272
▁2]	-9.31306
▁pair	-9.32005
▁1000000007	-9.32233
niterat	-9.32658
▁MAXN	-9.32839
▁"-1"	-9.33087
[5]	-9.33235
||	-9.33609
▁dy	-9.33624
▁X	-9.34296
▁otherwise	-9.35452
▁idx	-9.35562
nexit	-9.35977
nf	-9.36071
▁'+'	-9.36648
N	-9.36787
['	-9.3828
▁top	-9.38957
5	-9.39381
res	-9.39509
▁15	-9.3978
temp	-9.40407
▁root	-9.41037
▁curr	-9.41168
▁step	-9.41446
ntemp	-9.4214
▁ara	-9.42543
gcd	-9.42951
U	-9.43248
count	-9.43679
▁unsigned	-9.43842
▁mini	-9.44252
▁30	-9.44421
▁#	-9.44508
▁diff	-9.44567
▁plus	-9.44825
▁'#'	-9.44838
ng	-9.461
▁define	-9.46204
re	-9.46386
▁200	-9.46448
▁inf	-9.46727
▁up	-9.47152
▁yy	-9.48764
▁find	-9.48801
2,	-9.49086
show	-9.50537
▁'9'	-9.50668
multiply	-9.51311
▁pre	-9.51413
nr	-9.51442
▁square	-9.51481
▁110	-9.52057
1[0]	-9.52306
]=	-9.52646
▁G	-9.52671
▁100000	-9.53122
▁1005	-9.53405
T	-9.53458
▁\	-9.53579
No	-9.53767
▁prev	-9.5401
▁multiple	-9.55031
M	-9.55271
cur	-9.55284
[0]_._	-9.55463
▁which	-9.56102
Yes	-9.56653
▁rest	-9.57691
▁V	-9.57939
C	-9.58168
▁push	-9.58869
▁1])	-9.5946
nreverse	-9.60526
▁dist	-9.60758
▁endline	-9.60858
▁get	-9.61127
or	-9.61858
0_._	-9.62265
▁bitshift	-9.62353
▁bit	-9.62721
▁"#"	-9.62938
▁back	-9.63004
dp	-9.64178
▁|	-9.64184
▁power	-9.64502
▁Max	-9.65021
▁(2	-9.65249
here	-9.65331
▁test	-9.65951
nnum	-9.66156
nnew	-9.66473
▁100005	-9.6726
ncount	-9.67739
▁base	-9.68167
▁data	-9.68255
▁can	-9.68804
▁shift	-9.68922
▁Yes	-9.68935
▁further	-9.6902
▁iterator	-9.69198
increment	-9.69979
▁dif	-9.70042
ny	-9.70316
▁decremented	-9.70439
illed	-9.7063
▁mm	-9.71545
▁1001	-9.71949
▁divide	-9.72116
▁sz	-9.72194
▁25	-9.72252
▁decrease	-9.72387
▁ind	-9.7248
st	-9.72637
▁rem	-9.72888
▁(1	-9.72912
▁No	-9.73081
F	-9.73422
▁11	-9.73612
▁stop	-9.73695
X	-9.74589
▁"1"	-9.74998
set	-9.75768
start	-9.75852
is	-9.7587
1[1]	-9.76076
▁order	-9.76202
▁co	-9.76393
▁digit	-9.76903
▁__	-9.77188
al	-9.77261
▁most	-9.77639
▁append	-9.77925
▁whe	-9.77944
▁48	-9.78017
find	-9.78069
▁dis	-9.78277
back	-9.78555
▁dx	-9.78839
▁word	-9.79516
G	-9.79633
▁{0}	-9.80297
if	-9.81722
▁W	-9.81792
▁Y	-9.81865
▁10)	-9.82136
▁lcm	-9.82673
▁statement	-9.82789
nn	-9.82806
▁ex	-9.83413
▁ca	-9.83622
▁?	-9.837
[0][	-9.83713
▁mi	-9.84435
▁bb	-9.85248
▁my	-9.85418
▁found	-9.85434
▁us	-9.8588
▁least	-9.86066
abs	-9.86454
▁day	-9.86933
▁10000	-9.87008
I	-9.87419
▁Q	-9.87658
▁>>	-9.87774
▁lower	-9.87817
[0][0]	-9.87867
=2	-9.88246
▁"*"	-9.88402
▁score	-9.89174
▁valid	-9.90831
▁50	-9.90843
substr	-9.91081
▁low	-9.91188
▁pr	-9.91678
2[0]	-9.92165
▁item	-9.92329
▁_	-9.92533
nget	-9.92869
pair	-9.93159
▁letter	-9.93512
K	-9.93611
▁OR	-9.93893
get	-9.93971
▁3)	-9.94781
▁cin	-9.95129
()_._	-9.95238
index	-9.95488
▁judge	-9.95495
▁type	-9.95655
▁fa	-9.96046
6	-9.96633
▁stdout	-9.9706
▁55	-9.97725
tmp	-9.97894
▁getchar	-9.98157
▁sort	-9.98334
nswap	-9.98541
▁through	-9.98731
▁ceil	-9.99048
true	-9.99077
read	-9.99292
▁sqrt	-9.99496
[1]_._	-9.99582
▁cal	-9.99838
--	-9.99853
ndp	-9.99979
3)	-10.0016
W	-10.0033
▁!	-10.0044
7	-10.0047
▁id	-10.0104
▁adj	-10.0108
▁looping	-10.0127
-1)	-10.0179
▁table	-10.0225
nclear	-10.0238
▁4_._	-10.0387
▁exit	-10.0417
▁price	-10.0481
▁cek	-10.0498
▁init	-10.0515
mid	-10.0566
▁360	-10.059
▁chars	-10.0664
▁freq	-10.0679
▁does	-10.068
▁content	-10.0681
nerase	-10.0705
▁high	-10.0709
P	-10.0732
2]	-10.0741
▁mat	-10.0771
[0][1]	-10.0775
▁^	-10.0785
▁lo	-10.0787
1]	-10.0799
▁'4'	-10.0847
▁nothing	-10.0852
▁accept	-10.0857
▁"."	-10.0872
▁kol	-10.0883
▁pq	-10.0911
▁remainder	-10.0912
▁match	-10.0942
▁point	-10.0952
▁go	-10.0971
▁begin	-10.1009
flag	-10.1017
▁keep	-10.1043
▁stream	-10.1068
▁cmp	-10.1075
▁pow	-10.1127
-|	-10.1134
▁used	-10.1146
▁unique	-10.1151
▁setting	-10.1156
|	-10.1182
▁reference	-10.1228
ch	-10.1236
Y	-10.1239
and	-10.1251
▁'\0'	-10.1326
at	-10.1381
nlen	-10.1397
rock	-10.1398
▁booleans	-10.1448
▁strlen	-10.1466
scissors	-10.1493
▁dimension	-10.1526
2=	-10.1527
paper	-10.1528
▁sol	-10.1537
▁color	-10.1543
▁until	-10.1625
it	-10.1648
idx	-10.169
((	-10.1698
▁hi	-10.1703
▁fast	-10.1731
ndo	-10.1817
OOOO	-10.1823
▁op	-10.1839
print	-10.1847
▁win	-10.1865
lled	-10.1873
▁inline	-10.1927
▁after	-10.193
▁positive	-10.1938
▁'('	-10.1939
ngo	-10.1944
row	-10.202
▁rows	-10.2023
▁div	-10.205
nch	-10.2069
▁fb	-10.211
][2]	-10.2213
▁4)	-10.2213
[1][	-10.2246
▁memset	-10.2249
▁need	-10.2253
▁visit	-10.227
skip	-10.2286
▁=0	-10.2336
▁subtract	-10.2345
char	-10.235
prime	-10.2389
npos	-10.2405
-1][	-10.2421
▁'0')	-10.2425
▁doubles	-10.2436
8	-10.2443
:	-10.2444
▁address	-10.2458
▁10_._	-10.2484
▁items	-10.2503
2[1]	-10.2504
exclusive	-10.2547
nmax	-10.255
▁vectors	-10.2573
mod	-10.2589
▁primes	-10.2597
now	-10.2599
▁I	-10.2656
▁Friendship	-10.2689
nto	-10.2698
val	-10.2702
vector	-10.2712
->	-10.2733
▁isprime	-10.275
▁visited	-10.2822
▁upper	-10.2825
left	-10.283
time	-10.2832
▁exp	-10.286
make	-10.288
())	-10.2929
▁",	-10.2975
▁32	-10.3002
nstr	-10.3022
▁round	-10.3026
▁100001	-10.3076
ith	-10.3115
▁97	-10.3118
▁float	-10.3137
▁PI	-10.314
▁"-	-10.3153
in	-10.3205
▁minx	-10.3225
▁acos	-10.3237
▁:	-10.324
Z	-10.3254
mp	-10.3264
▁display	-10.3338
▁calling	-10.3347
TRIANGLE	-10.337
▁'?'	-10.3373
▁vv	-10.3382
nmx	-10.3382
▁H	-10.3386
nmin	-10.3393
[6]	-10.3418
▁inp	-10.3435
▁case	-10.3446
<=	-10.3458
▁cc	-10.3471
[1])	-10.3476
}	-10.3488
!"	-10.3488
▁tb	-10.3494
scending	-10.3503
▁store	-10.3508
▁resp	-10.3526
▁'8'	-10.3593
▁points	-10.36
ntmp	-10.3626
▁coun	-10.3641
▁bits	-10.3648
▁compare	-10.3654
of	-10.3655
▁""	-10.3657
▁Min	-10.3675
▁cout	-10.3728
nlong	-10.374
▁998244353	-10.374
OO	-10.3743
SEGMENT	-10.3764
1=	-10.3799
OOO	-10.3861
18	-10.3932
[1][0]	-10.3945
(0_._	-10.395
▁hh	-10.396
')	-10.396
boolean	-10.3962
[0])	-10.3994
▁dem	-10.3995
npop	-10.4011
nst	-10.4024
▁sy	-10.4028
the	-10.4088
▁nums	-10.4106
nfill	-10.4146
▁1000000	-10.4148
▁tp	-10.4149
▁1]_._	-10.4167
▁kk	-10.4202
[1][1]	-10.4235
▁ty	-10.426
▁re	-10.4275
▁key	-10.4277
▁yu	-10.4303
▁best	-10.4363
+1)	-10.4395
▁fl	-10.4431
out	-10.4558
>=	-10.4569
▁queue	-10.4603
10	-10.4633
▁minus	-10.4636
update	-10.4702
▁qm	-10.4702
▁2*	-10.4725
▁':'	-10.4785
▁columns	-10.4792
▁hash	-10.48
▁tt	-10.4809
RIGHT	-10.484
▁same	-10.4883
▁"-1	-10.4925
▁flg	-10.4937
V	-10.4958
cast	-10.4991
▁ck	-10.5002
absolute	-10.5063
▁O	-10.5077
nw	-10.5094
▁se	-10.5094
▁U	-10.5109
▁suma	-10.5114
▁sign	-10.5114
mx	-10.5117
Q	-10.5121
er	-10.5145
et	-10.5164
ll	-10.5188
▁da	-10.5205
▁isPrime	-10.5226
▁book	-10.5234
▁31	-10.5244
▁eps	-10.5247
▁cast	-10.533
>0	-10.5354
▁infinite	-10.5383
▁64	-10.5425
▁front	-10.5458
nq	-10.5459
[2]_._	-10.547
last	-10.5496
▁"/"	-10.5502
xx	-10.5503
▁grid	-10.5513
▁precision	-10.5525
▁red	-10.5536
Time	-10.5544
erminate	-10.556
Second	-10.5575
],	-10.5594
no	-10.5632
[7]	-10.5708
▁1000000000	-10.5709
(0)	-10.5741
▁sm	-10.5741
MIN	-10.5752
▁has	-10.5782
for	-10.5809
▁{	-10.5822
col	-10.5839
▁(((	-10.5861
/10	-10.5863
▁Z	-10.5905
▁ada	-10.5943
▁file	-10.5953
▁blue	-10.5957
-2	-10.5958
▁contain	-10.5959
▁'7'	-10.5961
▁cou	-10.5974
▁Arr	-10.5986
▁calc	-10.6002
▁level	-10.6008
ar	-10.6032
[2][1]	-10.6043
First	-10.6044
PRINT	-10.6044
▁days	-10.6082
▁'<'	-10.6111
▁multiply	-10.6112
▁1000000009	-10.6121
▁sb	-10.6126
▁arg	-10.6128
▁father	-10.6131
▁)_._	-10.6134
▁dig	-10.6146
▁mas	-10.6198
▁chest	-10.6207
name	-10.6222
▁EPS	-10.6272
▁squared	-10.6325
false	-10.636
IMPOSSIBLE	-10.6363
nz	-10.6375
=0_._	-10.6411
▁'_._	-10.642
element	-10.642
▁place	-10.6432
head	-10.6452
▁form	-10.6468
ne	-10.6491
▁po	-10.6507
4_._	-10.652
▁tc	-10.6598
nT	-10.663
▁ta	-10.6647
▁'0'_._	-10.6665
ninv	-10.667
[1][2]	-10.6672
▁"|"	-10.6725
▁201	-10.6734
▁three	-10.6743
ALMOST	-10.6758
▁magic	-10.6769
ntotal	-10.6771
oke	-10.6771
-2]	-10.6775
▁fi	-10.6782
!	-10.6805
▁args	-10.6805
▁rs	-10.6821
▁pref	-10.6832
black	-10.6839
value	-10.6841
▁biceps	-10.6862
LEFT	-10.6878
=(	-10.6881
▁keyboard	-10.6935
▁100010	-10.6938
▁rounded	-10.6938
▁stack	-10.694
▁remove	-10.695
▁Number	-10.6952
+2	-10.6953
▁(180	-10.6953
▁pass	-10.6954
▁pic	-10.6956
▁1.0	-10.7007
++]	-10.7025
▁2))	-10.7068
▁UP	-10.7073
▁DOWN	-10.7075
▁fin	-10.7092
▁F	-10.7093
▁falsy	-10.7107
▁{0_._	-10.7115
▁joy	-10.7144
+1][	-10.715
▁fixed	-10.7151
[2])	-10.7157
▁mult	-10.7189
▁con	-10.7202
▁1][0]	-10.7213
▁7)	-10.7234
▁brr	-10.7259
▁1][1]	-10.728
▁WINS	-10.7282
nu	-10.7291
▁'>'	-10.7294
▁negative	-10.7302
▁{1_._	-10.7303
▁tab	-10.731
▁lol	-10.7315
▁First	-10.7348
▁24	-10.7351
▁nl	-10.7352
▁1010	-10.7382
▁prog	-10.7458
▁list	-10.7467
▁TESTS	-10.7477
▁Dp	-10.7513
▁500	-10.7516
▁180	-10.7595
▁fun	-10.7642
▁hitung	-10.7647
ss	-10.7648
nret	-10.7653
▁move	-10.7658
▁cy	-10.7694
▁sub	-10.7703
▁Second	-10.7724
void	-10.776
▁yes	-10.7793
▁le	-10.7805
▁'|'	-10.7824
▁nonzero	-10.7825
▁'/'	-10.7826
nok	-10.784
▁aa	-10.7842
▁"#	-10.7847
▁ff	-10.7887
)]	-10.7893
▁distance	-10.7894
▁tem	-10.7923
▁5)	-10.7925
nmid	-10.7932
[2][0]	-10.794
▁ac	-10.8012
▁every	-10.8013
▁br	-10.8016
▁myset	-10.8039
▁board	-10.8045
▁fact	-10.8052
nwrite	-10.8057
▁gap	-10.8059
▁lucky	-10.8059
us	-10.8094
▁comp	-10.8108
▁sx	-10.8166
▁green	-10.8167
64_	-10.818
nmp	-10.8196
▁divisi	-10.8205
▁uneven	-10.8206
▁puts	-10.8225
▁')'	-10.8239
%	-10.8271
[0][2]	-10.8281
RU	-10.8285
ble	-10.8337
[(	-10.8369
*(	-10.8372
▁fuel	-10.8409
input	-10.841
▁good	-10.8414
▁sieve	-10.8431
▁tx	-10.8473
Friendship	-10.8574
txt	-10.8597
▁mins	-10.8598
come	-10.8601
▁spf	-10.8617
▁fathercnt	-10.8617
▁mymap	-10.8619
▁dir	-10.8621
▁pa	-10.8635
])_._	-10.8671
▁pw	-10.8685
result	-10.8745
▁su	-10.8764
decrement	-10.8778
▁ctr	-10.8797
▁guy	-10.8805
id	-10.8808
▁have	-10.8817
top	-10.8837
▁half	-10.8854
=3	-10.8896
RE	-10.8919
▁pri	-10.892
]-	-10.8922
▁multiplie	-10.893
Set	-10.8931
[2][2]	-10.8948
pow	-10.9004
▁10000000	-10.9013
▁{}	-10.9014
not	-10.9014
E	-10.9019
▁head	-10.902
▁hate	-10.9028
▁1000005	-10.9032
▁250)	-10.9058
▁qr	-10.9066
▁100_._	-10.9114
▁22	-10.9117
nvis	-10.9124
▁log	-10.9132
ter	-10.9153
(2_._	-10.9198
▁120	-10.9207
▁numbers	-10.922
▁winner	-10.9251
1+	-10.9256
▁rec	-10.9343
▁its	-10.9385
▁'['	-10.9401
1.	-10.942
ind	-10.9428
White	-10.9436
nmove	-10.944
▁Grades	-10.9444
▁respectively	-10.9444
LU	-10.9454
▁parameters	-10.9456
LD	-10.9467
RD	-10.9472
▁code	-10.9486
▁mul	-10.9493
▁-1}	-10.9506
nre	-10.9525
▁"+"	-10.9579
nA	-10.9594
ninitialize	-10.9616
Black	-10.9662
▁db	-10.9682
▁edges	-10.97
▁ele	-10.9704
right	-10.9718
▁.	-10.974
▁100)	-10.9748
ncur	-10.9755
▁tolower	-10.9798
▁def	-10.9803
nar	-10.9805
▁var	-10.9833
double	-10.9834
3,	-10.9838
0,	-10.9858
▁200000	-10.988
*2	-10.9881
▁HIM	-10.9893
▁HER	-10.9894
Akshat	-10.9895
▁matrix	-10.9896
▁chang	-10.9907
rat	-10.9909
IG	-10.9917
op	-10.9928
▁51	-10.9941
copy	-10.9942
nmemset	-10.9945
▁dep	-10.9956
▁msk	-10.9959
ncheck	-10.996
▁search	-10.9972
]=1	-11.0001
▁RIGHT	-11.0025
1-	-11.0038
=-1	-11.0038
_1	-11.0102
▁"2"	-11.0104
▁exist	-11.011
▁status	-11.0134
▁":"	-11.0141
▁16	-11.0166
red	-11.0172
▁contains	-11.0173
▁cap	-11.0246
[3])	-11.0251
new	-11.0254
-9	-11.0259
▁isok	-11.0272
^2	-11.0273
▁pairs	-11.0273
on	-11.0283
+1_._	-11.0287
create	-11.0302
▁skip	-11.0321
▁cx	-11.0331
ly	-11.0333
▁year	-11.0343
▁put	-11.0357
one	-11.0361
ret	-11.0365
▁modul	-11.0369
▁menor	-11.0369
▁sumb	-11.0376
Malvika	-11.0376
::	-11.0377
white	-11.0388
]-'	-11.0395
▁ql	-11.0415
step	-11.043
▁rep	-11.0432
▁Chris	-11.0449
▁Mishka	-11.0449
▁open	-11.0492
▁102	-11.0557
Power	-11.0585
▁done	-11.0597
number	-11.0606
▁way	-11.0607
▁decreasing	-11.0608
▁condition	-11.0612
▁turn	-11.0621
▁more	-11.0622
▁act	-11.0628
▁req	-11.0652
▁was	-11.0653
reduce	-11.0656
up	-11.066
else	-11.0673
▁LEFT	-11.0677
+2]	-11.0689
▁returni	-11.0693
Oh	-11.0693
++	-11.0706
ITH	-11.0712
▁rat	-11.0732
▁par	-11.0749
▁moves	-11.075
▁np	-11.076
▁27	-11.0773
▁(3	-11.0785
▁2,	-11.0819
▁decimal	-11.0827
yy	-11.0843
<0	-11.0857
▁itself	-11.0857
▁program	-11.0858
▁matches	-11.087
sqrt	-11.0881
blue	-11.0885
child	-11.0889
ay	-11.0917
▁"|	-11.0944
▁Count	-11.0945
▁reg	-11.0951
▁tam	-11.0969
2-	-11.0993
▁fill	-11.0996
▁med	-11.1047
▁pt	-11.1052
nS	-11.1066
la	-11.1097
▁hav	-11.1101
nN	-11.1113
▁Input	-11.1115
▁jj	-11.1115
▁priority	-11.113
2))	-11.1148
("	-11.1149
DOWN	-11.1149
▁endl	-11.115
UP	-11.1155
▁111	-11.1162
▁txt	-11.117
minus	-11.1174
▁5001	-11.119
▁0}	-11.1208
▁"0	-11.1259
vis	-11.1265
!^^	-11.1293
▁48)	-11.1306
ad	-11.138
▁lim	-11.1416
Correct	-11.142
woman	-11.142
fabs	-11.146
▁la	-11.1465
▁2000	-11.1465
▁0;	-11.1473
maxn	-11.1486
pt	-11.1532
▁cad	-11.1541
▁ccw	-11.1544
▁there	-11.1616
-1]_._	-11.1618
▁tree	-11.1637
▁'5'	-11.1647
▁lowercase	-11.1647
▁200005	-11.1657
▁200001	-11.1658
man	-11.169
bound	-11.1697
nresult	-11.1699
▁MIN	-11.17
npre	-11.1705
="	-11.1728
▁pp	-11.173
▁Ans	-11.1749
")	-11.1758
▁cot	-11.1763
▁bigge	-11.1848
▁18	-11.1884
[8]	-11.191
▁cycle	-11.1912
▁maxm	-11.1912
▁method	-11.1931
▁love	-11.1944
▁graph	-11.1957
position	-11.1961
Reality	-11.1978
Space	-11.1979
Soul	-11.198
ncost	-11.198
#"]	-11.1985
Mind	-11.1986
▁save	-11.1988
3=	-11.2001
▁cup	-11.202
▁ms	-11.2056
▁big	-11.2073
][3]	-11.2074
▁forward	-11.2074
1][	-11.2088
▁update	-11.209
▁sup	-11.209
▁starty	-11.2095
nC	-11.2097
▁mo	-11.2167
▁jump	-11.2188
▁infinitely	-11.2211
▁fabs	-11.2216
▁"?"	-11.2216
▁rl	-11.2246
creasing	-11.2246
▁mask	-11.2246
▁extra	-11.2253
▁sq	-11.2259
green	-11.2267
▁2005	-11.228
proceed	-11.231
▁tm	-11.2313
25	-11.2321
nor	-11.2328
▁dat	-11.2335
nmaxx	-11.2337
▁pl	-11.2373
▁maps	-11.2415
▁cod	-11.2431
▁Correct	-11.2452
▁game	-11.2488
▁work	-11.249
AND	-11.25
Color	-11.2502
▁goal	-11.251
▁udmoves	-11.2511
▁rlmoves	-11.2511
▁curlower	-11.2512
▁hasil	-11.2516
▁DP	-11.2521
▁mov	-11.2525
▁alpha	-11.2532
▁coins	-11.2537
nindex	-11.2538
▁gr	-11.2551
▁divis	-11.2552
▁lenb	-11.2579
▁dm	-11.2601
▁PRINT	-11.2624
▁letters	-11.2625
▁1;	-11.2632
▁fix	-11.2638
nj	-11.2675
total	-11.2746
▁lessons	-11.2749
▁ed	-11.2755
▁pi	-11.2776
cost	-11.2787
▁tim	-11.2799
berOfPartialAns	-11.2799
▁width	-11.2807
▁13	-11.2813
▁side	-11.2819
▁flog	-11.282
▁diag	-11.283
▁startx	-11.2833
▁state	-11.2839
▁short	-11.2841
2(	-11.2845
▁write	-11.2851
▁MX	-11.2895
Ron	-11.2921
▁lb	-11.2925
ninline	-11.2943
▁incremented	-11.2955
es	-11.2968
nh	-11.2975
till	-11.3007
▁sc	-11.3021
▁digits	-11.3043
▁divisor	-11.3083
▁35	-11.3107
▁ver	-11.3111
cw	-11.3113
▁Solve	-11.3127
▁path	-11.3137
▁parent	-11.3144
▁reverse	-11.3152
▁possible	-11.3169
▁240	-11.3182
▁220	-11.3183
▁cr	-11.3187
▁convert	-11.3191
reate	-11.3195
Karen	-11.3213
▁cw	-11.3221
▁bl	-11.3222
base	-11.3255
▁sw	-11.3267
digit	-11.3268
diff	-11.3275
▁tar	-11.3275
▁300	-11.3333
low	-11.3344
▁iter	-11.3361
▁bound	-11.3382
tr	-11.3398
led	-11.3422
▁3*	-11.3442
▁large	-11.3442
▁smaller	-11.3443
▁weak	-11.3444
▁contador	-11.3452
▁poly	-11.3464
▁lst	-11.3465
▁chair	-11.3474
▁psum	-11.3481
▁'^'	-11.3485
▁stringstream	-11.3493
both	-11.3497
▁"+	-11.353
Dodecahedron	-11.3538
Tetrahedron	-11.3539
Octahedron	-11.3539
then	-11.3542
Cube	-11.3542
queue	-11.3544
TEAM	-11.3549
nfo	-11.3612
▁9)	-11.3617
▁steps	-11.3661
oo	-11.3675
▁cond	-11.3677
curr	-11.3721
▁floor	-11.3765
▁light	-11.3775
▁23	-11.3777
▁edge	-11.383
)/2	-11.3846
▁9_._	-11.3856
ccw	-11.3866
-1-	-11.3868
empty	-11.3869
▁names	-11.387
power	-11.3883
Mahmoud	-11.3892
Ehab	-11.3894
▁answ	-11.3901
orange	-11.3907
[2][	-11.3912
▁till	-11.3966
ct	-11.3989
▁36	-11.4008
▁250	-11.4028
um	-11.4069
]+	-11.4085
nma	-11.4087
nlast	-11.4097
_._"	-11.4113
)))	-11.4138
▁star	-11.4162
npr	-11.4169
▁sqr	-11.4182
nMOD	-11.4184
▁soma	-11.4196
as	-11.42
▁1000000007)	-11.4215
shift	-11.4216
▁ones	-11.4221
front	-11.4225
▁counts	-11.4226
▁20000	-11.4287
▁150	-11.4298
▁jum	-11.43
▁Ehab	-11.4348
▁Mahmoud	-11.435
][1])	-11.4351
▁TEAM	-11.4356
▁wi	-11.4363
ve	-11.4369
▁1}	-11.4375
chest	-11.4417
▁banyak	-11.4438
tc	-11.4443
▁28	-11.4475
▁uppercase	-11.4478
▁largest	-11.4486
▁over	-11.4495
▁cards	-11.4505
0)	-11.4512
▁"#.	-11.4527
▁2001	-11.4528
▁86400	-11.4535
fa	-11.4536
▁null	-11.4537
▁poww	-11.4548
nright	-11.4554
prev	-11.4558
H	-11.4563
▁money	-11.4566
▁slen	-11.4572
▁nuts	-11.4575
▁summ	-11.4577
▁erase	-11.4584
biceps	-11.4616
purple	-11.4618
▁vs	-11.4619
yellow	-11.462
let	-11.4622
▁cha	-11.4624
▁nCr	-11.4633
▁Impossible	-11.4642
▁home	-11.4642
▁Incorrect	-11.465
maxx	-11.4685
ign	-11.4688
ndis	-11.4692
5_._	-11.4694
▁proceed	-11.4722
vec	-11.4723
▁ne	-11.4725
nput	-11.4784
▁chk	-11.479
equal	-11.4791
▁%=	-11.4823
▁maxs	-11.4825
▁123	-11.4833
line	-11.4835
▁part	-11.4839
]))	-11.4846
▁Rozdil	-11.4848
▁active	-11.4848
▁stdin	-11.485
▁strcmp	-11.485
▁GCD	-11.4855
▁clock	-11.4857
▁MN	-11.4872
▁ll	-11.4892
▁Next	-11.4903
▁"4"	-11.4915
captain	-11.4943
[{	-11.4947
▁122	-11.4976
▁iterat	-11.4987
+(	-11.4987
signed	-11.4995
▁neg	-11.5
Leonard	-11.5003
Sheldon	-11.5003
Rajesh	-11.5003
Howard	-11.5004
Penny	-11.5004
50	-11.5008
▁poss	-11.5022
[0]]	-11.5038
node	-11.5039
-1_._	-11.5075
points	-11.51
nit	-11.5121
(1	-11.5132
)*	-11.5136
return	-11.5149
en	-11.5166
J	-11.5175
>(	-11.5179
▁cp	-11.5184
declare	-11.5184
▁3]	-11.5218
nmn	-11.522
permutation	-11.5231
▁previous	-11.5233
▁spyke	-11.524
▁'3'	-11.5249
▁96	-11.5253
▁oven	-11.5254
pre	-11.5254
▁final	-11.5258
mber	-11.5276
▁players	-11.5278
▁hor	-11.5283
nstep	-11.5291
▁speed	-11.5292
▁lca	-11.5305
▁lena	-11.5315
co	-11.5327
ither	-11.5343
ary	-11.5376
Icosahedron	-11.5389
Hermione	-11.5396
major	-11.5396
▁Anton	-11.5411
▁byte	-11.5425
minor	-11.5428
far	-11.544
push	-11.5446
▁captain	-11.5459
level	-11.5466
▁pm	-11.5505
naux	-11.5507
_0	-11.5538
▁indx	-11.5539
dif	-11.5555
nanswer	-11.5558
ta	-11.5562
▁follow	-11.5574
▁hb	-11.5583
7_._	-11.5584
▁mode	-11.5586
▁command	-11.5603
▁en	-11.5618
▁1.0)	-11.5628
▁-2	-11.5629
fantasy	-11.5631
▁factor	-11.5631
▁label	-11.5638
▁gl	-11.564
+1)/2	-11.5641
If	-11.5644
▁loss	-11.5647
cr	-11.5651
▁numOps	-11.5658
▁carry	-11.5659
▁'='	-11.5662
▁90	-11.5674
▁sp	-11.5688
modulo	-11.5692
NG	-11.5693
▁92	-11.5707
▁"-"	-11.5712
▁del	-11.5719
▁present	-11.5719
▁box	-11.5729
▁maxy	-11.5734
/5	-11.5736
jj	-11.5737
log	-11.5737
▁numb	-11.5748
▁execute	-11.575
card	-11.5776
▁pal	-11.5786
[2	-11.5803
▁Danik	-11.5816
nval	-11.5821
CHA	-11.5822
forward	-11.5822
▁nex	-11.5823
▁fx	-11.5824
[9]	-11.5839
▁maxa	-11.5848
▁retur	-11.5894
▁old	-11.5902
[3]_._	-11.5905
ncont	-11.5918
))_._	-11.596
▁itr	-11.5966
ntot	-11.6012
buil	-11.6027
."	-11.6029
▁rx	-11.6031
▁remaining	-11.6042
▁GRAPH	-11.6051
hi	-11.6052
nsolve	-11.6054
▁chess	-11.6063
▁solution	-11.6067
▁month	-11.6072
▁205	-11.6074
▁trees	-11.6092
▁el	-11.6093
▁inv	-11.6098
▁rta	-11.6123
▁qua	-11.6125
▁memo	-11.6128
▁hp	-11.6138
lol	-11.6141
▁dim	-11.6142
▁10005	-11.6149
+1]-	-11.6169
pointer	-11.6202
▁th	-11.6211
root	-11.6227
backward	-11.6257
nfirst	-11.6261
▁19	-11.6261
▁pro	-11.6308
▁(4	-11.6317
▁0.5	-11.6339
▁am	-11.6343
▁va	-11.6343
rr	-11.6349
▁fy	-11.6357
▁maxl	-11.6357
dest	-11.6385
]-'0'	-11.639
▁ab	-11.6401
▁ope	-11.6407
▁501	-11.6433
zxcvbnm	-11.6482
▁jarak	-11.6482
▁matriz	-11.6484
▁capacity	-11.6484
▁infinity	-11.6484
▁weight	-11.649
▁md	-11.6492
[25]	-11.6492
▁soroban	-11.6495
team	-11.6498
▁atkm	-11.6501
▁E	-11.6502
▁getline	-11.6505
▁sumA	-11.6507
▁fff	-11.652
▁'2'	-11.6521
▁hy	-11.6522
▁{"	-11.6534
▁bfs	-11.6535
▁que	-11.6538
▁cycles	-11.6549
▁rot	-11.6556
▁mmap	-11.6573
3372036854775807	-11.6599
▁black	-11.6618
square	-11.6628
][0])	-11.6632
▁sta	-11.6635
▁team	-11.6654
▁tstep	-11.6658
▁depth	-11.666
home	-11.669
▁Vasya	-11.6704
Misha	-11.6709
Vasya	-11.671
▁1].	-11.6714
▁seq	-11.6716
Tie	-11.6717
-(	-11.672
nbool	-11.6724
▁words	-11.6729
▁128	-11.673
-8	-11.6764
▁40	-11.6766
▁limit	-11.6775
▁65	-11.6784
aux	-11.6797
-1.0	-11.6813
>1	-11.6813
/(	-11.6825
]>	-11.6832
ara	-11.6834
▁Set	-11.6891
▁imax	-11.6915
▁remain	-11.6915
▁pointe	-11.692
sort	-11.6921
ndfs	-11.6934
▁misha	-11.6937
oop	-11.6937
▁Vasilisa	-11.6938
▁error	-11.6938
▁Pic	-11.6939
counter	-11.6943
▁asd	-11.6943
▁ha	-11.6944
▁Need	-11.6948
▁cell	-11.6949
▁bisa	-11.695
asdfghjkl	-11.6953
▁participants	-11.6958
It	-11.6966
▁like	-11.6967
▁"5"	-11.6979
▁shu	-11.698
▁ry	-11.6988
▁vet	-11.6997
▁votes	-11.6998
▁fr	-11.7006
minimum	-11.7007
▁tag	-11.7028
ncounter	-11.7034
nmark	-11.7049
▁invert	-11.706
ndiff	-11.7091
▁prices	-11.7095
To	-11.711
}]	-11.7113
ma	-11.7115
▁1000001	-11.7116
▁"1	-11.7129
▁ra	-11.7172
map	-11.7184
Incorrect	-11.7184
nname	-11.7185
whichPosn	-11.7185
undefined	-11.7185
def	-11.7213
_2	-11.7222
▁isdigit	-11.7224
nL	-11.7238
nvisited	-11.7275
se	-11.7298
le	-11.7299
▁7-	-11.7307
)(	-11.7326
▁multi	-11.7339
▁lead	-11.7367
-6	-11.7396
▁player	-11.7403
▁amount	-11.7411
▁comparator	-11.7413
▁vetor	-11.7415
▁given	-11.7418
an	-11.7419
▁505	-11.7422
▁interval	-11.7422
▁5005	-11.7423
▁1000006	-11.7425
▁huiwen	-11.7435
pp	-11.7436
▁larger	-11.745
resize	-11.7456
Int	-11.7457
(3	-11.7458
▁pas	-11.7466
▁raw	-11.7467
9_._	-11.7496
2+	-11.75
▁vowel	-11.7505
▁alt	-11.7506
▁target	-11.7507
▁levels	-11.7511
npri	-11.7516
add	-11.7521
te	-11.7549
▁tep	-11.7562
[10]	-11.7578
)/	-11.7589
▁card	-11.7595
om	-11.7601
▁tr	-11.7622
▁whichPosn	-11.7646
color	-11.7652
▁inch	-11.7654
loop	-11.7675
/2)	-11.768
▁xmax	-11.7681
Impossible	-11.7684
▁toupper	-11.7685
Danik	-11.7686
Anton	-11.7687
▁chris	-11.7714
depth	-11.773
[100]	-11.78
▁ysum	-11.7811
ncr	-11.7812
(-1)	-11.7821
▁take	-11.7829
MAXN	-11.7834
▁beat	-11.7837
▁999999	-11.7844
▁rotate	-11.7877
▁ios	-11.7879
▁parameter	-11.7884
▁(-1)	-11.7892
▁sumz	-11.7897
▁miny	-11.7902
▁To	-11.7903
[0],	-11.7911
Slava	-11.7913
▁person	-11.7913
▁nextDiv	-11.7913
▁sushu	-11.7913
9+7	-11.7913
▁password	-11.7913
▁'}'	-11.7915
▁toggle	-11.7917
▁zeroes	-11.7918
▁xay	-11.7921
▁indefinitely	-11.7923
▁DFS	-11.7924
▁"1/2"	-11.7925
▁binary	-11.7927
▁"1/1"	-11.7933
4,	-11.7933
▁atky	-11.7934
▁bills	-11.7936
▁2000000	-11.7937
so	-11.7949
▁400	-11.7959
div	-11.7984
▁use	-11.8043
▁chr	-11.8074
subtractions	-11.8085
▁8)	-11.8089
(-1.0	-11.809
▁sec	-11.81
▁{-1	-11.8102
(2	-11.811
▁increas	-11.8134
▁loc	-11.8146
▁backward	-11.8146
8_._	-11.815
▁undefined	-11.8159
▁Misha	-11.817
rem	-11.8196
▁CHA	-11.8197
nnow	-11.8199
Ciel	-11.8203
UR	-11.8213
ways	-11.8235
▁1]]	-11.8242
▁node	-11.8245
rs	-11.8246
*5	-11.8287
▁gg	-11.8296
▁bs	-11.8302
win	-11.8356
LO	-11.8358
open	-11.8365
▁copy	-11.8373
▁distanc	-11.8427
▁stone	-11.8431
▁gesture	-11.8439
hello	-11.8439
▁'!'	-11.844
▁boxes	-11.844
▁crew	-11.8441
▁isgro	-11.8442
nzero	-11.8445
▁de	-11.8446
▁exgcd	-11.845
do	-11.8451
▁"5/6"	-11.8451
▁"1/3"	-11.8452
▁"2/3"	-11.8452
▁hm	-11.8455
▁salt	-11.8461
▁record	-11.8461
▁blyat	-11.8463
▁alph	-11.847
nMax	-11.848
▁cmd	-11.8484
▁'6'	-11.8485
▁pointers	-11.8488
▁buff	-11.8493
▁exe	-11.8493
-1])	-11.8515
▁bob	-11.8515
▁0.0	-11.8517
nle	-11.853
lo	-11.8533
par	-11.8582
moves	-11.8595
][0][	-11.8605
odd	-11.8614
▁Bob	-11.8634
ajout	-11.8641
▁Alice	-11.8647
▁(360	-11.8653
('	-11.8658
▁29	-11.8662
nmod	-11.8671
▁colors	-11.8686
+1))	-11.8688
next	-11.8695
▁"="	-11.8703
[3][	-11.8708
▁zz	-11.8712
▁!(	-11.8718
>()	-11.8718
Danil	-11.8734
Nikita	-11.8738
tin	-11.874
Olya	-11.8741
▁nxt	-11.8751
Hanako	-11.8757
change	-11.8761
▁orange	-11.8763
half	-11.8763
Output	-11.8766
▁gets	-11.8768
Dasha	-11.877
Equal	-11.8771
Masha	-11.8776
▁sheets	-11.8783
▁qq	-11.8785
ncurr	-11.881
▁pot	-11.8811
ndir	-11.8846
dd	-11.8863
▁SEGMENT	-11.8864
act	-11.8867
nco	-11.8868
pri	-11.8873
nde	-11.8907
BA	-11.8935
▁plen	-11.8936
▁siz	-11.8947
▁di	-11.8955
]][	-11.899
▁jumlah	-11.8995
▁available	-11.8995
popcount	-11.8995
▁entered	-11.8995
▁raise	-11.8996
▁pole	-11.9
▁leaf	-11.9005
ULL	-11.9006
Ju	-11.9006
ntransform	-11.9007
▁2147483647	-11.9008
▁buf	-11.9009
▁powmod	-11.901
/7	-11.9022
*10+	-11.9022
▁bran	-11.9028
▁other	-11.9028
']['	-11.9029
▁mishka	-11.9031
[++	-11.9032
▁LCM	-11.9032
▁bottles	-11.9034
▁CUR	-11.9046
▁stones	-11.9049
▁bao	-11.9056
AB	-11.9059
▁600	-11.9084
▁Qr	-11.9088
point	-11.9091
colom	-11.9094
▁(7	-11.91
dg	-11.9102
capital	-11.9122
▁Cnt	-11.9146
▁xsum	-11.9153
▁60_._	-11.9162
▁Sum	-11.917
▁atk	-11.9174
▁pd	-11.9198
nout	-11.9216
+3	-11.9223
▁Equal	-11.9224
ceil	-11.9224
3[	-11.9286
nara	-11.9289
numberOfStudents	-11.9298
▁newdp	-11.9298
ngcd	-11.9305
▁iterations	-11.9309
▁(8	-11.9318
▁clo	-11.9322
▁Time	-11.9325
dimension	-11.9335
▁yellow	-11.9348
UL	-11.9353
Alice	-11.9355
nM	-11.9373
ult	-11.9388
▁dd	-11.9395
ul	-11.9416
digits	-11.9421
▁sumr	-11.9441
▁ymin	-11.9463
▁1][2]	-11.9479
▁woman	-11.9481
ate	-11.9488
▁ba	-11.9493
yes	-11.9499
nvec	-11.9503
▁ey	-11.9541
ra	-11.9542
^	-11.9554
▁goto	-11.9555
▁lc	-11.9555
▁li	-11.9559
Colours	-11.9583
Elephant	-11.9583
▁difference	-11.9583
Bear	-11.9583
▁inches	-11.9584
▁computer	-11.9586
▁qtb	-11.9593
▁frest	-11.9594
▁setprecision	-11.9596
▁vest	-11.961
▁lenght	-11.9613
▁repeat	-11.9614
▁QAQ	-11.9622
▁Bulbasaur	-11.9623
▁contiguous	-11.9633
▁21	-11.9636
▁quotient	-11.9637
▁amounts	-11.9659
▁wei	-11.9666
▁spec	-11.967
▁suff	-11.9678
▁sumB	-11.9682
nputs	-11.9684
▁pe	-11.9694
while	-11.9731
▁lon	-11.9737
▁floats	-11.9739
all	-11.9742
solve	-11.9776
▁greate	-11.9778
▁tmo	-11.979
▁qy	-11.9808
ry	-11.9809
▁9999999	-11.9824
▁men	-11.9825
ntime	-11.9831
nused	-11.9834
that	-11.985
▁sh	-11.9853
▁endy	-11.9855
break	-11.9871
▁Tie	-11.9889
dy	-11.9894
ncrease	-11.9932
lcm	-11.9966
impossible	-11.9968
Mishka	-11.9975
Chris	-11.9976
ULDR	-11.9977
search	-11.9981
Bob	-11.9982
distance	-11.9982
▁ite	-11.9984
-1]+	-11.9988
Pos	-11.999
maxi	-12.0004
▁(9	-12.0007
▁counta	-12.001
DR	-12.0013
DL	-12.0015
▁ys	-12.0024
ement	-12.0024
epend	-12.0031
▁1])_._	-12.0061
▁2.0	-12.0063
▁palin	-12.0069
-7	-12.0086
",	-12.0093
#"	-12.0095
reset	-12.0103
▁10001	-12.0113
▁ymax	-12.0124
check	-12.0124
▁dr	-12.0157
▁cs	-12.0174
▁sumy	-12.0175
▁occurrence	-12.0176
▁gc	-12.0177
2.	-12.0178
▁incrementin	-12.0194
BigInteger	-12.0208
Koyomi	-12.0208
▁amazing	-12.0208
▁Sentence	-12.0208
▁location	-12.0208
▁numDiv	-12.0208
Ann	-12.0212
▁format	-12.0215
▁emm	-12.0217
▁"7"	-12.0223
▁highest	-12.0226
▁fuck	-12.0226
from	-12.0229
▁four	-12.0234
▁load	-12.0235
▁hotels	-12.0236
▁smallest	-12.0236
▁column	-12.024
▁dict	-12.0243
▁dc	-12.0245
▁func	-12.0247
▁Blue	-12.025
▁err	-12.0254
▁"1/6"	-12.026
▁tail	-12.0274
cont	-12.0285
▁dg	-12.029
nidx	-12.0295
▁cakes	-12.0298
▁1000003	-12.0299
▁games	-12.0299
▁10010	-12.03
▁52	-12.0307
ong	-12.0311
▁lef	-12.0326
▁Md	-12.0341
▁hang	-12.0342
ngoto	-12.0351
▁0))	-12.0352
▁tha	-12.0375
ha	-12.0376
▁fim	-12.0384
▁lfp	-12.0393
!^^"	-12.0408
2["	-12.042
▁"|#.	-12.0431
▁prf	-12.0441
▁hit	-12.0459
▁ansy	-12.0467
▁maxim	-12.0472
=1_._	-12.0504
1000000007	-12.0528
▁pairt	-12.0531
nmm	-12.0538
▁mxv	-12.0545
▁100000000	-12.0558
▁lg	-12.0565
▁59	-12.0572
-1)/2	-12.0574
*10	-12.0584
▁-1)	-12.0589
▁Penny	-12.0592
unsigned	-12.0592
▁Howard	-12.0593
float	-12.06
substring	-12.0621
qwertyuiop	-12.0637
▁14	-12.0641
contest	-12.0644
sz	-12.0646
TIE	-12.0647
▁ev	-12.0656
▁pb	-12.0671
[105]	-12.0679
▁show	-12.0687
▁bak	-12.069
▁tri	-12.073
▁103	-12.0738
▁Masha	-12.0739
incremented	-12.0749
1["	-12.0751
nprev	-12.0754
ent	-12.0762
day	-12.0762
▁gra	-12.0764
▁xor	-12.0776
▁posy	-12.0797
+1)*	-12.08
▁oo	-12.0817
▁2}	-12.0819
]]]	-12.0826
post	-12.0829
▁gh	-12.0838
▁wp	-12.0843
mm	-12.0844
▁finish	-12.0855
output	-12.0857
▁bus	-12.0868
fffffff	-12.0874
Alien	-12.0875
NEITHER	-12.0875
▁palabra	-12.0875
▁factorial	-12.0875
▁danik	-12.0875
▁"***"	-12.0875
▁lowest	-12.0875
▁lzl	-12.0876
▁fives	-12.0876
▁pause	-12.0878
]+1	-12.0878
▁horizontal	-12.0878
▁basis	-12.0878
▁maxSize	-12.0879
▁bottom	-12.088
▁occ	-12.0881
▁qmarks	-12.0882
exadecimal	-12.0884
▁coord	-12.0886
▁process	-12.0888
▁biaoji	-12.0889
▁finall	-12.0891
▁maxsum	-12.0891
invert	-12.0892
▁arya	-12.0896
▁sumc	-12.09
▁+1	-12.09
Max	-12.0901
▁arra	-12.0902
▁sumpo	-12.0906
▁qpow	-12.0906
list	-12.0909
inner	-12.0918
ndist	-12.0919
stream	-12.0925
▁commands	-12.0925
▁shit	-12.0926
▁perm	-12.093
endline	-12.0933
xor	-12.0937
▁lie	-12.0939
▁Ql	-12.0949
nINF	-12.0957
▁slogan	-12.0957
▁qx	-12.0963
OT	-12.097
turn	-12.0971
▁bad	-12.0972
▁foo	-12.0984
nconvert	-12.0996
▁cpy	-12.1004
▁tdiff	-12.1009
atk	-12.1018
▁incrementi	-12.1018
▁mmax	-12.1023
1=0	-12.1058
▁deg	-12.1058
▁newsum	-12.1066
▁strange	-12.1074
▁mie	-12.1086
▁TIE	-12.1107
▁anton	-12.1108
elete	-12.111
▁contest	-12.1114
";	-12.112
price	-12.1121
▁(2*	-12.1128
zero	-12.1141
▁Dasha	-12.1153
run	-12.1155
▁xmin	-12.1158
▁maxr	-12.1163
▁maxv	-12.117
type	-12.1181
getchar	-12.1187
score	-12.1193
/4	-12.1209
▁notes	-12.1214
▁1]))	-12.122
nitem	-12.1229
ncek	-12.1232
nother	-12.1263
1}	-12.1273
ped	-12.1274
▁Rajesh	-12.1287
▁Sheldon	-12.1288
▁Leonard	-12.1288
[4][	-12.1293
▁endx	-12.1295
ax	-12.1296
▁ay	-12.1312
▁cntr	-12.1315
nMin	-12.1317
[0][0]_._	-12.1317
▁17	-12.1329
tp	-12.1344
▁turns	-12.1346
]/2	-12.1349
-3]	-12.1354
▁'0']	-12.1362
nB	-12.1368
sub	-12.1373
ment	-12.1385
execute	-12.1385
nvalid	-12.1391
▁tempm	-12.1394
▁maxlen	-12.1397
save	-12.1399
ending	-12.1403
with	-12.1425
▁deq	-12.1427
▁stu	-12.145
gap	-12.1452
▁resta	-12.1469
tot	-12.1474
▁sss	-12.1502
▁(5	-12.1532
layer	-12.1563
▁marks	-12.1563
1))	-12.158
▁prealoc	-12.1589
zhuangtai	-12.1589
▁amigos	-12.1589
▁soldier	-12.1589
▁voters	-12.1589
▁initial	-12.1589
▁myMap	-12.1589
▁static	-12.1589
/100	-12.1591
▁workdays	-12.1592
▁Way	-12.1593
▁grest	-12.1595
=2*	-12.1604
▁criba	-12.1604
▁searchres	-12.1605
▁5000	-12.1606
▁findfa	-12.1606
▁height	-12.1606
▁305	-12.1608
▁faces	-12.1611
Delete	-12.1614
▁freopen	-12.1614
▁Hash	-12.162
▁rub	-12.1627
▁"<"	-12.1627
▁">"	-12.1632
▁app	-12.164
nleft	-12.1645
/2+1	-12.1646
▁spect	-12.1646
▁vowels	-12.1649
▁vasya	-12.1654
▁Minb	-12.1669
adj	-12.167
▁acum	-12.1672
2=0	-12.1672
▁10]	-12.1673
▁fac	-12.1686
mark	-12.1687
▁tu	-12.1695
nrow	-12.1713
[4][2]	-12.1722
▁cmax	-12.1727
ting	-12.1729
▁palindrome	-12.1736
names	-12.1745
▁nx	-12.1748
nmaxi	-12.1755
▁2])	-12.1764
by	-12.1773
▁Mina	-12.1777
▁pv	-12.179
▁10000000000	-12.1798
▁']'	-12.1807
▁ep	-12.1837
nmonth	-12.1839
{	-12.1846
▁xxx	-12.1852
▁notup	-12.187
newline	-12.1879
▁abc	-12.1916
▁'_._'	-12.1935
nxx	-12.1954
▁send	-12.196
▁emp	-12.1963
nmaxn	-12.1978
▁zsum	-12.1999
word	-12.201
▁mmin	-12.2014
encont	-12.204
Num	-12.2048
▁fans	-12.2048
▁6)	-12.2068
maximum	-12.207
00	-12.2091
plus	-12.2106
halfplus	-12.2109
3))	-12.2113
HARD	-12.2127
EASY	-12.2127
Count	-12.213
notup	-12.2132
▁ww	-12.2133
▁per	-12.2139
none	-12.2145
-"	-12.2151
pref	-12.2156
▁3000	-12.2158
lower	-12.2166
ally	-12.2185
el	-12.2192
nint	-12.2204
▁child	-12.2215
mn	-12.2217
▁{2	-12.224
31_._	-12.2283
▁ls	-12.229
big	-12.2302
nrem	-12.2308
nsecond	-12.231
▁suf	-12.2334
(0)_._	-12.2351
lus	-12.2353
▁xop	-12.2354
▁acc	-12.2356
▁decrypt	-12.2358
klmnopqrstuvwxyz	-12.2358
aeiou	-12.2358
▁reqrec	-12.2358
▁center	-12.2358
▁sa	-12.2359
▁Init	-12.236
▁descending	-12.236
▁merge	-12.2361
▁indices	-12.2364
▁pearls	-12.2367
▁satu	-12.2369
▁INFF	-12.237
▁actual	-12.2372
▁single	-12.2374
▁liter	-12.2374
▁primeFactures	-12.2375
▁army	-12.2375
ndx	-12.2376
▁Cmp	-12.2389
▁denominator	-12.2389
nlabel	-12.2396
▁sisa	-12.24
▁(2^	-12.2407
▁100007	-12.2408
_._./"	-12.2417
▁going	-12.2421
▁ANS	-12.2427
▁fpow	-12.2428
▁workTime	-12.2429
▁loct	-12.2437
▁slot	-12.2445
▁offset	-12.2455
][0]_._	-12.2456
mini	-12.246
▁clear	-12.2476
|)"	-12.2487
▁97]	-12.2492
▁minP	-12.2494
▁opt	-12.2498
▁skill	-12.2512
est	-12.2513
▁ats	-12.252
1[2]	-12.252
▁rock	-12.2521
+1])	-12.255
▁sumne	-12.2556
▁99	-12.2567
#.#.#.#.#.#.	-12.2567
▁gmax	-12.2567
▁cm	-12.2568
terminate	-12.2579
INF	-12.258
nsuma	-12.2582
exp	-12.2593
nR	-12.2593
+1,	-12.2594
▁fla	-12.2602
▁sl	-12.2606
▁(-	-12.2619
than	-12.2625
▁modu	-12.2629
▁sag	-12.263
▁ctx	-12.265
os	-12.2655
▁this	-12.2657
nstore	-12.2662
▁pod	-12.2674
▁isupper	-12.2677
▁ust	-12.2683
▁maxcount	-12.2702
-1][0]	-12.2706
▁terminate	-12.2707
4)	-12.2717
▁ru	-12.2727
▁99999999	-12.2747
▁yb	-12.2754
'0'	-12.2783
▁maxcnt	-12.279
▁assigne	-12.2797
▁wh	-12.28
ghi	-12.2804
▁purple	-12.2859
▁mapp	-12.2862
▁bc	-12.2871
ninf	-12.2881
_4	-12.2886
1)_._	-12.2888
▁57	-12.2889
[2]-	-12.2906
][4]	-12.2921
64	-12.2929
TH	-12.2931
compare	-12.294
[1],	-12.2941
thursday	-12.295
fixed	-12.295
tuesday	-12.2951
saturday	-12.2951
sunday	-12.2951
monday	-12.2952
friday	-12.2952
lfp	-12.2954
+5	-12.2955
▁99999	-12.2955
strange	-12.2962
(1)	-12.2979
▁answers	-12.2985
▁dest	-12.2989
▁vct	-12.2991
pr	-12.2993
leave	-12.3009
▁zy	-12.3022
][1]_._	-12.3035
▁3,	-12.3068
[1000]	-12.3078
▁999999999	-12.3085
▁cant	-12.3086
▁te	-12.3095
▁Power	-12.3102
▁>0	-12.3115
dot	-12.3121
upper	-12.3139
stu	-12.3158
▁inputs	-12.316
▁rank	-12.317
▁taken	-12.3189
edge	-12.3189
▁excluisve	-12.3192
▁prohibited	-12.3192
optimization	-12.3192
▁consecutive	-12.3192
▁inicio	-12.3192
▁tedad	-12.3192
▁biao	-12.3192
▁numOf	-12.3192
Letter	-12.3192
▁47	-12.3193
▁buffer	-12.3193
stripe	-12.3193
▁groups	-12.3193
▁linha	-12.3193
▁bigmod	-12.3194
rado	-12.3201
▁smL	-12.3201
▁diamond	-12.3205
▁101_._	-12.3205
▁smR	-12.3206
▁dragon	-12.3206
▁duplicates	-12.3206
▁ALPH	-12.3207
▁ad	-12.3207
▁query	-12.3208
▁simon	-12.3209
▁oil	-12.3214
▁hold	-12.3215
▁third	-12.3219
▁page	-12.3221
lIdx	-12.3221
▁delta	-12.3225
character	-12.3226
nOtherwise	-12.3226
▁distinct	-12.3226
▁Alex	-12.3227
▁fastexp	-12.3228
▁blocked	-12.323
▁common	-12.3231
▁lft	-12.3233
▁dua	-12.3235
▁nega	-12.3239
▁Map	-12.3242
▁towels	-12.3243
▁primos	-12.3243
▁prod	-12.3248
▁timr	-12.325
▁cdays	-12.325
▁eC	-12.3254
▁'_'	-12.3254
▁permute	-12.326
▁angle	-12.3264
▁ihash	-12.3293
app	-12.3299
15	-12.3301
gdc	-12.3306
▁kanan	-12.3309
cc	-12.3314
▁1000010	-12.3335
nsz	-12.3337
▁neo	-12.3337
sign	-12.334
▁zx	-12.3346
nminn	-12.3352
▁(26	-12.3356
▁inc	-12.3357
▁kkk	-12.3361
nstring	-12.3364
▁solx	-12.3365
)]=	-12.337
nmini	-12.3376
▁maxval	-12.3379
▁sorted	-12.3381
-1,	-12.3391
nse	-12.3398
▁cel	-12.3432
▁Len	-12.3461
▁substr	-12.3463
#.	-12.3466
▁divs	-12.3468
▁ref	-12.3471
nyakyangmilihini	-12.3473
▁main	-12.3503
▁12]	-12.3514
▁lens	-12.3516
Sum	-12.3518
nMAX	-12.3523
▁180)	-12.3544
▁rla	-12.355
current	-12.3566
▁but	-12.3571
▁fu	-12.3588
▁ptr	-12.3599
▁vect	-12.3627
vowel	-12.3644
▁ro	-12.3645
▁lin	-12.3656
▁che	-12.3657
▁maxnum	-12.3662
iterator	-12.3663
▁bools	-12.3666
▁doit	-12.3676
bitwise	-12.3684
▁inter	-12.3687
vv	-12.3692
▁gp	-12.3702
be	-12.3705
dist	-12.371
ts	-12.3719
eat	-12.3723
▁""_._	-12.3742
▁posx	-12.3756
▁ten	-12.3774
▁J	-12.3778
▁bk	-12.3783
▁1100	-12.3787
ndy	-12.3832
01	-12.3834
▁dia	-12.3838
[5])	-12.3838
TO	-12.384
insert	-12.384
rt	-12.3844
▁compar	-12.3845
▁got	-12.3848
ot	-12.3849
▁}	-12.3856
lucky	-12.386
money	-12.3868
prefix	-12.3872
6_._	-12.3879
ignore	-12.3885
nsub	-12.389
▁dos	-12.3903
nct	-12.3913
▁pet	-12.3919
[0]][0]	-12.3923
numberOfElements	-12.3942
nnext	-12.3945
dx	-12.3946
+1+	-12.3947
▁mc	-12.3948
tabla	-12.3966
abc	-12.3969
ize	-12.3971
bak	-12.3973
▁tC	-12.3986
2)_._	-12.3988
▁lsum	-12.3993
Au	-12.3994
he	-12.4
tt	-12.4001
▁\0	-12.4011
erase	-12.4043
100	-12.4058
amt	-12.4058
ctr	-12.4061
are	-12.4072
sion	-12.4073
▁wt	-12.4078
][1][	-12.4081
qta	-12.4081
erate	-12.4083
tam	-12.409
▁face	-12.4095
▁paper	-12.4099
rd	-12.4099
▁vid	-12.41
▁Posution	-12.4101
▁interrupted	-12.4101
▁execution	-12.4101
▁fastIo	-12.4101
▁huruf	-12.4101
▁students	-12.4101
▁'{'	-12.4101
▁nextPrime	-12.4102
▁rides	-12.4102
▁izq	-12.4103
▁small	-12.4105
▁friends	-12.4105
▁Mul	-12.4105
qr	-12.4108
▁disC	-12.411
▁geek	-12.4114
▁nearest	-12.4118
▁people	-12.4118
▁Vector	-12.4118
▁negativos	-12.4118
▁jumlahgenap	-12.4118
▁build	-12.4119
▁32767	-12.4119
Min	-12.4128
▁isalpha	-12.4132
▁prevlen	-12.4134
Left	-12.4134
▁cols	-12.4135
▁isVowel	-12.4137
▁discounts	-12.414
▁before	-12.4143
road	-12.4147
▁ranks	-12.4149
▁ifstream	-12.415
▁only	-12.415
1*	-12.4151
▁End	-12.4154
▁|.|	-12.4161
▁minIncl	-12.4161
need	-12.4162
▁locg	-12.4164
▁rprev	-12.4164
▁yf	-12.4165
_8	-12.4167
▁skills	-12.4167
▁nama	-12.4181
▁matching	-12.4182
yu	-12.4183
lose	-12.4184
▁appear	-12.4187
▁modexp	-12.4195
nEPS	-12.42
biggest	-12.4201
ab	-12.4201
▁maks	-12.4202
▁block	-12.4205
▁drink	-12.4212
[1	-12.4212
nPI	-12.4222
marks	-12.4231
[100000]	-12.4238
#	-12.4268
▁tims	-12.4272
▁pwr	-12.4277
skill	-12.4285
▁127	-12.4288
.0	-12.4292
nfir	-12.4301
▁dsa	-12.4306
▁prevc	-12.4307
▁(_	-12.4314
esp	-12.4322
neo	-12.4326
▁1000000001	-12.4328
▁fir	-12.4333
1>	-12.4346
▁minm	-12.4354
▁odds	-12.4355
ice	-12.4365
▁"3"	-12.4374
cod	-12.4378
▁cntb	-12.443
sec	-12.4432
▁=0_._	-12.4445
▁area	-12.4446
▁suml	-12.4451
▁join	-12.446
)-	-12.4468
▁gla	-12.4485
▁maxN	-12.449
fb	-12.4492
▁imin	-12.4513
%2	-12.4517
(10	-12.4517
li	-12.452
▁4)]	-12.4536
▁nowp	-12.454
▁xb	-12.4543
-10	-12.4556
ql	-12.4584
▁100100	-12.4589
▁ways	-12.4605
▁50)	-12.4613
nms	-12.4615
▁uu	-12.4645
nfreq	-12.466
12	-12.469
nfound	-12.4701
▁"_._0	-12.4713
eps	-12.4714
'-'	-12.4716
▁maxb	-12.4743
44	-12.4766
hh	-12.4784
▁Karen	-12.4794
ion	-12.4811
data	-12.4817
ntest	-12.4821
eg	-12.4826
nuts	-12.4829
unique	-12.4831
Total	-12.4859
wednesday	-12.4859
='	-12.486
occur	-12.4872
joy	-12.4877
▁hc	-12.488
▁60)	-12.4884
▁999	-12.491
infinite	-12.4916
▁Ron	-12.4918
kol	-12.4923
99	-12.494
days	-12.4955
▁rate	-12.4959
/60	-12.4971
1_	-12.4976
chat	-12.4979
▁80	-12.4988
----------	-12.5011
nchar	-12.5013
rminate	-12.5015
(2*	-12.5023
▁2;	-12.5024
Factor	-12.5025
/3	-12.5062
1(	-12.5066
▁feet	-12.5074
▁ti	-12.5083
nTe	-12.5084
▁9999999999	-12.5085
-|"	-12.5085
eque	-12.509
▁caso	-12.5095
Index	-12.5095
▁INPUT	-12.5101
▁OUTPUT	-12.5101
▁brainfuck	-12.5101
▁inputLength	-12.5101
▁maxExcl	-12.5101
▁nineteen	-12.5101
▁qClose	-12.5101
DELTA	-12.5101
▁dynamic	-12.5101
▁fakem	-12.5101
ization	-12.5101
▁busca	-12.5101
▁perColor	-12.5101
▁echo	-12.5101
▁MAT	-12.5101
showpoint	-12.5103
▁pangkat	-12.5105
▁desk	-12.5105
▁minute	-12.5106
▁putchar	-12.5106
▁stud	-12.5107
-2)	-12.511
visited	-12.5113
▁suck	-12.5113
▁mima	-12.5114
▁4000000	-12.5114
▁shengyu	-12.5118
nI	-12.5118
▁walk	-12.5119
▁minimal	-12.512
▁manz	-12.5121
▁heap	-12.5121
fact	-12.5121
▁2002	-12.5124
▁hangx	-12.5126
▁finder	-12.5126
▁backw	-12.5132
high	-12.5134
▁coty	-12.5134
▁limak	-12.5137
▁choose	-12.5141
▁256	-12.5143
▁wait	-12.5145
▁rmark	-12.5148
▁src	-12.5149
▁mk	-12.515
▁sizeedge	-12.5157
▁nike	-12.5158
▁beginat	-12.516
▁conv	-12.5164
▁integ	-12.5167
▁fail	-12.5172
med	-12.5185
▁medals	-12.5191
▁syl	-12.5191
▁Hm	-12.5193
Print	-12.52
▁200010	-12.5201
inclusive	-12.5201
▁eaten	-12.5204
ok	-12.5204
▁nimpar	-12.5208
▁getint	-12.522
▁sym	-12.5223
▁nneg	-12.5224
5,	-12.5227
▁ya	-12.5233
▁exists	-12.5236
#.#.#.#.#.	-12.5244
▁cn	-12.5245
▁dic	-12.5255
rot	-12.5257
▁endpos	-12.5259
soma	-12.5259
▁digitm	-12.5259
[101]	-12.5264
wt	-12.5267
▁cups	-12.5267
=5	-12.5273
dep	-12.5274
da	-12.5288
▁stat	-12.5293
▁jol	-12.5296
ncurrent	-12.53
▁ml	-12.5307
ios	-12.5317
▁"4	-12.5319
eate	-12.5322
▁added	-12.5326
▁bo	-12.5331
ER	-12.5333
▁hr	-12.5334
[1000]_._	-12.5336
▁scissors	-12.5353
cup	-12.5358
splay	-12.5362
thing	-12.5367
▁seg	-12.5379
▁umb	-12.5396
▁normal	-12.5412
▁EASY	-12.5413
▁HARD	-12.5413
▁sumx	-12.5428
▁flat	-12.5454
pw	-12.5464
▁Dy	-12.5475
▁upd	-12.5485
▁Num	-12.5491
))))	-12.5509
▁DL	-12.5527
Ja	-12.5529
[1]][1]	-12.5545
▁npar	-12.5557
▁((1	-12.5573
▁compa	-12.558
▁lat	-12.5597
aa	-12.5605
nV	-12.5615
+4	-12.5624
▁nadj	-12.5632
▁sel	-12.5633
ries	-12.564
rea	-12.5644
gh	-12.5647
▁+=	-12.5652
▁jwb	-12.5665
()]	-12.5682
▁ny	-12.5688
▁divid	-12.5694
tri	-12.5699
▁inve	-12.5703
▁primer	-12.5719
>=0	-12.5733
▁100002	-12.5733
▁ke	-12.5742
gu	-12.5744
▁seat	-12.5754
ls	-12.5768
[1]]	-12.5769
▁cut	-12.5777
▁isn	-12.5807
▁las	-12.5817
rest	-12.5826
LINF	-12.5828
▁1}_._	-12.586
▁(10	-12.5866
-1][1]	-12.5873
letter	-12.5876
MINN	-12.5889
minx	-12.59
▁ud	-12.5922
block	-12.5936
SS	-12.5943
-----------	-12.5964
nex	-12.597
currnum	-12.5976
palindrome	-12.5989
target	-12.5992
▁reduce	-12.5994
▁atoi	-12.6003
▁off	-12.6009
▁-1000	-12.6009
]])	-12.6017
fingers	-12.6028
30_._	-12.6053
|"	-12.606
▁ui	-12.6063
▁Oh	-12.6066
▁3.14159	-12.608
3[0]	-12.6101
▁mmp	-12.6108
bru	-12.6111
Cb	-12.6116
▁incremen	-12.6135
▁Malvika	-12.6139
bool	-12.6139
▁iC	-12.6145
▁hour	-12.618
▁-10	-12.6182
▁Akshat	-12.6189
ange	-12.6195
]][1]	-12.6202
]=0	-12.6204
▁choc	-12.6205
3]	-12.6206
▁maxc	-12.6206
Gym	-12.6212
▁exlcusive	-12.6212
ZerosOnes	-12.6212
