<pad>	0
<s>	0
</s>	0
<unk>	0
\	-2.11457
n	-3.07383
;	-3.12012
▁=	-3.38483
▁(	-3.63583
i	-3.66158
▁	-3.75544
}	-3.79031
▁i	-3.8453
▁{	-3.87771
▁<<	-3.93407
=	-4.06795
▁<	-4.09684
[	-4.14274
▁0;	-4.26003
▁>>	-4.2688
_._	-4.31156
▁n	-4.42457
nif	-4.4843
nint	-4.49104
▁+	-4.64899
)	-4.68644
ncout	-4.69505
nfor	-4.70549
int	-4.7355
▁a	-4.76693
]	-4.80963
▁-	-4.81073
(	-4.83004
++)	-4.87642
▁endl	-4.90235
ncin	-4.92763
>	-5.04238
nreturn	-5.15396
▁1;	-5.16367
▁j	-5.20266
▁s	-5.22499
▁main	-5.23563
#	-5.23696
▁std	-5.24026
pace	-5.24167
ude	-5.24229
▁names	-5.24231
ostream	-5.24493
▁"	-5.26048
▁b	-5.26406
ncl	-5.36079
a	-5.37122
▁int	-5.40938
▁long	-5.41324
▁x	-5.49479
long	-5.52535
▁m	-5.53224
▁*	-5.55267
j	-5.5854
▁k	-5.59678
.	-5.61345
()	-5.63612
▁>	-5.66449
▁c	-5.68546
];	-5.7207
(){	-5.76467
s	-5.78083
ing	-5.82132
▁0)	-5.82747
nus	-5.82791
1	-5.82995
▁%	-5.85301
"	-5.85749
▁/	-5.87185
);	-5.88237
▁&	-5.90418
&	-5.90913
▁else	-5.92237
nelse	-5.92865
++;	-5.92922
▁ans	-5.93661
==	-5.93912
x	-5.99965
▁y	-6.01767
2	-6.02062
nu	-6.02206
sing	-6.05876
▁t	-6.10378
▁1)	-6.12127
ile	-6.18589
nwh	-6.19547
▁'	-6.24706
▁0	-6.2697
_	-6.28638
▁1	-6.30696
▁!	-6.31263
▁d	-6.35711
▁}	-6.38579
▁if	-6.42558
▁2	-6.42915
t	-6.46574
b	-6.48206
,	-6.48711
▁p	-6.50032
][	-6.50978
nstring	-6.51215
";	-6.54956
▁l	-6.57555
size	-6.59758
();	-6.61498
▁sum	-6.63465
▁v	-6.67587
k	-6.6952
▁r	-6.70773
▁2;	-6.7094
nans	-6.78396
▁1]	-6.84104
▁min	-6.84724
1_._	-6.84928
<	-6.86098
▁max	-6.86182
])	-6.86737
c	-6.87931
▁cin	-6.88196
0_._	-6.8864
▁cout	-6.92101
||	-6.94134
l	-6.95972
▁arr	-6.97296
[0]	-7.00213
y	-7.00871
m	-7.00943
▁++	-7.01541
NO	-7.02757
▁2)	-7.08167
▁cnt	-7.13286
YES	-7.14466
nbreak	-7.15301
na	-7.18602
p	-7.18981
')	-7.24193
▁str	-7.24918
nc	-7.25497
r	-7.25719
f	-7.27295
';	-7.28093
▁f	-7.28346
--)	-7.33809
▁true	-7.37011
3	-7.372
nchar	-7.39619
ans	-7.40865
--;	-7.4121
nsum	-7.41333
bool	-7.41947
cin	-7.43335
▁num	-7.44099
2;	-7.44492
e	-7.4475
[1]	-7.45754
▁q	-7.45892
push	-7.45901
v	-7.46083
▁false	-7.48655
nx	-7.49561
'	-7.50005
▁return	-7.5064
back	-7.51682
▁res	-7.54151
ns	-7.54171
▁count	-7.57266
length	-7.58033
▁((	-7.59108
▁temp	-7.59859
d	-7.60429
nb	-7.61219
nvector	-7.63626
nsort	-7.65483
cl	-7.65682
arr	-7.68038
str	-7.70616
▁z	-7.71155
2)	-7.72553
▁abs	-7.74262
▁3;	-7.75337
▁10;	-7.77093
in	-7.78183
▁flag	-7.78236
))	-7.78525
▁h	-7.82426
sum	-7.82939
▁w	-7.8313
end	-7.83521
nt	-7.85042
▁(!	-7.85902
begin	-7.86058
]);	-7.89748
▁len	-7.90048
▁1);	-7.92294
▁10	-7.93228
1;	-7.94507
▁-1	-7.99799
u	-8.0027
char	-8.02171
A	-8.0338
")	-8.04036
▁:	-8.04836
▁break	-8.05231
?	-8.05323
▁N	-8.05724
nm	-8.06026
ontinue	-8.06337
cnt	-8.06669
▁1])	-8.07436
▁mod	-8.07833
ncons	-8.07887
].	-8.0968
[2]	-8.10416
));	-8.10526
flag	-8.10817
▁'\	-8.10828
++	-8.1265
void	-8.1358
ncnt	-8.16421
ny	-8.17252
▁3	-8.17442
1)	-8.18495
string	-8.20838
nk	-8.21557
▁e	-8.2273
1[	-8.22989
▁4;	-8.24213
());	-8.2454
nflag	-8.24813
set	-8.24902
▁dp	-8.25686
▁ch	-8.26023
▁-1;	-8.26649
▁A	-8.27274
num	-8.27841
▁4	-8.28526
▁"\	-8.30265
np	-8.30275
())	-8.32866
▁5;	-8.3288
▁g	-8.33044
▁tmp	-8.34798
nd	-8.34798
▁gcd	-8.3632
N	-8.36541
▁1];	-8.38317
nr	-8.38356
h	-8.38478
▁sizeof	-8.39471
▁u	-8.40209
o	-8.4028
q	-8.4124
len	-8.42025
▁3)	-8.42175
nmem	-8.42411
nv	-8.42442
z	-8.43825
▁1][	-8.44535
D	-8.44537
nl	-8.46924
temp	-8.47228
2[	-8.47868
▁mx	-8.50562
("	-8.52222
second	-8.54607
abs	-8.5476
");	-8.55554
nres	-8.56292
max	-8.57296
▁st	-8.58204
first	-8.61726
count	-8.62053
[3]	-8.62363
R	-8.62736
]++;	-8.62753
insert	-8.63007
ch	-8.63155
▁7;	-8.63963
nf	-8.6483
S	-8.66478
ncount	-8.6832
0	-8.68376
▁get	-8.69294
pos	-8.70553
min	-8.70592
maxn	-8.71037
nmap	-8.71661
B	-8.72748
O	-8.74159
inc	-8.75713
nputs	-8.75754
▁5	-8.78453
▁mp	-8.81323
w	-8.8201
▁1))	-8.82537
▁S	-8.82941
find	-8.83683
▁8;	-8.83754
g	-8.84129
▁mid	-8.84671
double	-8.84683
▁-1)	-8.87355
[0];	-8.88298
res	-8.89813
ntemp	-8.90286
1.	-8.90747
▁MOD	-8.91385
L	-8.91729
▁'0')	-8.93307
▁pos	-8.94298
nst	-8.95831
nnum	-8.95908
▁'0';	-8.96486
9	-8.98369
▁M	-8.98381
▁ar	-8.98582
nset	-8.98874
▁7	-8.98919
MAX	-8.99118
][0]	-8.99177
']	-8.9945
substr	-8.9955
narr	-9.00148
▁'0'	-9.00548
ne	-9.02049
▁{0}	-9.02372
▁B	-9.03983
T	-9.04652
"_._	-9.04666
nco	-9.04752
▁solve	-9.04812
st	-9.0495
▁2);	-9.05905
ni	-9.06152
▁T	-9.06778
▁6;	-9.087
▁10)	-9.0965
<<	-9.1012
dp	-9.10151
1++;	-9.10914
[4]	-9.10932
vis	-9.11591
LL	-9.11787
▁val	-9.13046
ndp	-9.13207
3;	-9.13731
(0);	-9.14317
▁5)	-9.18276
--	-9.18342
▁double	-9.18758
C	-9.19945
mp	-9.20211
▁2]	-9.20368
▁and	-9.20577
Yes	-9.20777
▁4)	-9.20995
check	-9.21279
No	-9.22076
▁total	-9.22816
▁L	-9.23421
▁check	-9.24158
▁result	-9.24669
-	-9.24855
nmp	-9.25096
[5]	-9.26239
[105]	-9.27108
2);	-9.27405
tmp	-9.28311
[0])	-9.29656
▁'-')	-9.30587
▁7)	-9.30653
▁cur	-9.31649
I	-9.31993
]]	-9.32337
▁'1')	-9.32615
▁swap	-9.33245
nq	-9.33665
▁"-1"	-9.348
▁INT	-9.35082
4	-9.35275
[1])	-9.35898
"]	-9.35979
▁dfs	-9.3646
signed	-9.37374
▁vis	-9.37909
▁"0"	-9.37988
M	-9.38655
][1]	-9.38813
0;	-9.39313
['	-9.39508
▁"";	-9.39745
▁ok	-9.39751
U	-9.40151
▁ret	-9.42014
▁|	-9.42054
3)	-9.42312
cur	-9.42797
▁ss	-9.43264
3_._	-9.43888
ng	-9.44201
++]	-9.45882
▁P	-9.46424
▁"*";	-9.47242
▁100;	-9.47284
2++;	-9.47814
▁R	-9.47938
▁name	-9.48951
pair	-9.49063
((	-9.49333
▁C	-9.49607
▁prime	-9.49899
erase	-9.50078
▁sqrt	-9.50943
▁now	-9.52007
▁counter	-9.52077
▁last	-9.53333
["	-9.55208
gcd	-9.55245
ok	-9.56191
[100]	-9.56309
nw	-9.57112
nmax	-9.58865
G	-9.59567
nz	-9.59952
▁it	-9.60751
▁vec	-9.60871
2.	-9.61073
▁xx	-9.61203
it	-9.61314
nh	-9.61395
▁maxx	-9.62416
1);	-9.62614
now	-9.6286
▁'9')	-9.63404
mx	-9.63556
▁K	-9.63766
▁"#";	-9.65245
▁o	-9.6607
▁ma	-9.666
▁1000;	-9.6678
▁INF	-9.67717
nj	-9.68194
▁'+')	-9.6843
pop	-9.68541
K	-9.68716
X	-9.68884
[101]	-9.68911
ar	-9.69304
[6]	-9.69792
▁tot	-9.70355
[1];	-9.71846
start	-9.72015
[10]	-9.72267
if	-9.724
5	-9.7272
MAXN	-9.73261
▁26;	-9.73483
▁input	-9.7358
▁'*')	-9.73745
1[0]	-9.74693
]))	-9.75156
ngetli	-9.76026
prime	-9.76047
▁cont	-9.7634
▁ceil	-9.76494
▁row	-9.7652
▁aux	-9.76947
▁dy	-9.76973
▁"1"	-9.77847
cout	-9.77855
nmin	-9.78101
out	-9.78143
▁new	-9.78213
iterator	-9.78412
▁6	-9.79763
>::	-9.80902
▁(2	-9.81719
{	-9.82273
[3];	-9.82769
nreverse	-9.82794
]]++;	-9.82825
line	-9.83649
W	-9.8436
top	-9.84822
▁(1)	-9.8485
▁left	-9.85638
▁100	-9.8572
[1000]	-9.86119
▁1000000007;	-9.87296
▁'.')	-9.87516
ntotal	-9.87896
index	-9.88041
nch	-9.8813
F	-9.88549
ntmp	-9.88685
▁^	-9.89004
▁12;	-9.89459
P	-9.90117
▁second	-9.91035
empty	-9.91115
▁start	-9.91202
▁yy	-9.91268
npos	-9.91817
->	-9.92265
▁__	-9.92271
▁minn	-9.92551
▁read	-9.92833
ndfs	-9.92867
cmp	-9.93015
nmx	-9.93061
▁cost	-9.94067
▁index	-9.9455
▁MAX	-9.94728
[1005]	-9.94759
▁time	-9.94859
▁maxi	-9.95152
nvis	-9.95354
▁8	-9.95483
[2])	-9.95793
▁right	-9.98126
[110]	-9.98306
+	-9.98581
at	-9.98888
1[1]	-9.98896
▁9;	-9.99466
idx	-9.99472
▁col	-9.99787
▁ara	-10.0045
Z	-10.0132
▁6)	-10.0133
▁inf	-10.014
▁answer	-10.0162
▁pow	-10.0192
mid	-10.0212
[100005]	-10.0248
nstr	-10.0272
▁maxn	-10.0274
val	-10.0321
(2	-10.0354
▁number	-10.0406
V	-10.041
▁".";	-10.0429
▁60	-10.0501
▁mn	-10.0521
[0][0]	-10.0531
]--;	-10.0545
true	-10.0579
ron	-10.0656
▁8)	-10.0661
▁'1'	-10.0695
Y	-10.0717
hed	-10.0731
nswap	-10.0732
▁'#')	-10.0826
row	-10.0921
▁string	-10.0937
▁1]);	-10.096
Q	-10.0995
▁X	-10.1011
▁(1	-10.11
Friendship	-10.1131
▁lcm	-10.1188
cos	-10.1343
[2];	-10.1347
name	-10.1377
xx	-10.1386
[0][	-10.139
▁'#';	-10.1396
▁(((	-10.1431
1]	-10.1442
nresult	-10.1558
▁first	-10.1582
▁co	-10.1592
9;	-10.1596
nnow	-10.1673
▁D	-10.1698
▁dist	-10.1712
▁diff	-10.1737
▁pre	-10.1903
▁ct	-10.1931
clea	-10.1992
mark	-10.2109
Second	-10.2117
nok	-10.2144
▁find	-10.2169
mod	-10.2296
▁"-1	-10.2298
ncur	-10.233
First	-10.2348
▁idx	-10.2369
::	-10.2389
last	-10.2391
▁step	-10.2396
▁word	-10.2402
[4];	-10.2486
▁base	-10.2493
▁0))	-10.2524
▁2))	-10.2631
▁G	-10.269
float	-10.2733
make	-10.2744
-|	-10.2803
col	-10.2815
▁value	-10.2843
▁prev	-10.2875
nget	-10.2887
time	-10.2899
▁'(')	-10.2935
64_	-10.2949
day	-10.2962
!"	-10.2979
RIGHT	-10.2984
▁my	-10.3028
2]	-10.3042
return	-10.3061
▁'*';	-10.3128
rock	-10.3131
2))	-10.3134
▁power	-10.3166
no	-10.3196
is	-10.3198
'_._	-10.3203
▁'\0';	-10.3238
[0][1]	-10.3247
digit	-10.325
▁char	-10.3299
▁one	-10.33
npair	-10.3302
▁20;	-10.3305
nsolve	-10.3312
▁curr	-10.3331
▁"-	-10.3372
▁mm	-10.3404
▁'1';	-10.3406
paper	-10.3442
▁V	-10.3464
le	-10.3591
maxx	-10.3658
input	-10.3665
▁H	-10.3767
▁end	-10.3775
0)	-10.3793
▁'0');	-10.3798
');	-10.3802
▁dif	-10.3813
or	-10.3816
[100000]	-10.3841
ss	-10.3866
▁dx	-10.3867
▁'.';	-10.3873
[1001]	-10.3938
tolower	-10.3954
nval	-10.3967
pow	-10.4015
▁100)	-10.4055
▁Max	-10.4132
front	-10.4148
*	-10.416
[26]	-10.4163
get	-10.4247
▁1000	-10.4257
precision	-10.4338
LEFT	-10.4338
ntot	-10.4349
[1][	-10.4437
nA	-10.4475
value	-10.4492
SEGMENT	-10.4539
▁9)	-10.4544
left	-10.4587
ngets	-10.4619
▁sz	-10.462
PRINT	-10.4641
OOOO	-10.4644
Time	-10.4651
▁bb	-10.4654
[8]	-10.468
nline	-10.4713
▁mark	-10.4739
]])	-10.4743
DOWN	-10.4745
UP	-10.4746
▁rem	-10.4763
ue	-10.4767
▁price	-10.4777
▁mini	-10.4822
▁div	-10.4827
▁9	-10.4859
nlast	-10.4926
ncounter	-10.4934
[3])	-10.4961
▁26	-10.4984
']++;	-10.5002
▁cmp	-10.5068
nret	-10.5149
re	-10.5175
ncon	-10.518
▁3);	-10.5221
|	-10.5225
▁'4'	-10.5245
▁data	-10.5272
[7]	-10.5276
▁11;	-10.5278
else	-10.528
6	-10.5284
▁(!(	-10.5337
▁or	-10.5357
▁200;	-10.5381
diff	-10.5411
[]	-10.5438
▁10);	-10.5462
('	-10.5469
][1];	-10.548
vec	-10.5588
ret	-10.5618
▁Y	-10.5626
visited	-10.5648
▁'8')	-10.5688
element	-10.5698
sors	-10.5741
id	-10.5754
▁dis	-10.5803
total	-10.5818
puts	-10.5885
ncheck	-10.5888
▁tb	-10.5892
[3][3]	-10.5915
nn	-10.5921
▁'4')	-10.5968
▁test	-10.5971
▁fb	-10.5984
nexit	-10.6009
ara	-10.6038
ma	-10.6049
▁low	-10.6052
▁1));	-10.6104
▁adj	-10.6107
▁mi	-10.6112
▁'7')	-10.6132
ntinue	-10.6145
▁998244353	-10.618
TRIANGLE	-10.6191
fa	-10.6219
▁ex	-10.6292
▁(0);	-10.6298
4;	-10.6303
2[0]	-10.6344
▁12	-10.6351
▁day	-10.6383
OO	-10.6386
▁"|";	-10.6386
▁"0";	-10.6433
nmaxx	-10.6491
▁table	-10.653
▁high	-10.6561
open	-10.6573
▁next	-10.6574
number	-10.6636
▁0);	-10.6682
OOO	-10.6682
es	-10.6699
ndo	-10.6714
2(	-10.6715
▁top	-10.6742
▁(180	-10.6771
▁15)	-10.6799
▁4);	-10.6808
counter	-10.6827
aux	-10.6837
nS	-10.6847
7	-10.685
▁two	-10.6868
ear	-10.6881
▁'?')	-10.6884
▁to	-10.6899
▁line	-10.6921
▁"0	-10.6936
ncont	-10.7007
tot	-10.7077
nlen	-10.7142
][2]	-10.7144
ios	-10.7217
▁";	-10.7244
▁score	-10.7261
right	-10.7262
[0]);	-10.7262
▁pr	-10.732
reg	-10.7331
▁60;	-10.7335
result	-10.7349
[200]	-10.7353
ind	-10.7375
nindex	-10.7425
▁primes	-10.7463
black	-10.747
▁ind	-10.7494
curr	-10.7508
nma	-10.7515
[1][0]	-10.7553
of	-10.7594
red	-10.7595
Correct	-10.7604
▁hh	-10.7627
[1][1]	-10.7686
▁judge	-10.774
▁minx	-10.7769
up	-10.7773
for	-10.7775
▁size	-10.7805
▁tt	-10.7808
▁fast	-10.7816
co	-10.782
exp	-10.7824
MIN	-10.7826
▁cal	-10.7849
[10000]	-10.7867
(1	-10.7881
ncost	-10.7887
▁output	-10.7924
▁W	-10.7925
▁tc	-10.7939
▁fa	-10.7961
▁30	-10.7971
▁ty	-10.7971
win	-10.7991
▁--	-10.8009
nanswer	-10.8014
IMPOSSIBLE	-10.8027
▁add	-10.8052
ll	-10.8086
head	-10.8107
vector	-10.8177
▁':')	-10.8198
chest	-10.8224
▁vv	-10.8266
op	-10.8284
▁31	-10.8329
▁da	-10.8333
▁E	-10.835
▁"/"	-10.8354
][1])	-10.8364
TE	-10.8403
E	-10.8429
▁qm	-10.8446
upper	-10.8451
sqrt	-10.8452
▁12)	-10.8497
▁1][0]	-10.8498
cpy	-10.8505
txt	-10.8534
(3	-10.8534
▁32;	-10.8566
▁op	-10.8567
[2	-10.8599
sci	-10.8613
dif	-10.8632
(0	-10.8738
▁id	-10.8739
▁(360	-10.8772
io	-10.8795
▁out	-10.88
▁48;	-10.8802
▁')')	-10.8811
▁mat	-10.8815
▁sol	-10.8882
nday	-10.8911
data	-10.892
0];	-10.892
nprev	-10.896
[100001]	-10.896
blue	-10.8987
nque	-10.9012
▁freq	-10.9037
nM	-10.9045
▁Min	-10.9058
[30]	-10.9074
>>	-10.91
▁Q	-10.9112
▁20)	-10.9112
stream	-10.9117
ncurr	-10.9128
▁"2"	-10.9194
▁2])	-10.9351
▁fixed	-10.9385
▁inp	-10.9407
nmn	-10.9412
3);	-10.9417
)(	-10.9419
[0].	-10.9442
[1]);	-10.946
nar	-10.9467
▁eps	-10.9471
biceps	-10.9492
ntime	-10.95
step	-10.9503
▁100000;	-10.9554
ALMOST	-10.958
PS	-10.9586
[5][5]	-10.9588
▁15	-10.9601
cost	-10.9609
▁go	-10.9611
▁magic	-10.9614
tr	-10.9615
][0];	-10.9623
3))	-10.9631
[11]	-10.9632
▁-1}	-10.969
▁25	-10.9695
18;	-10.9707
▁WINS	-10.9761
cw	-10.9765
AM	-10.9766
▁1][1]	-10.9827
▁5]	-10.9844
found	-10.9848
▁np	-10.9853
nss	-10.9853
getli	-10.9863
▁init	-10.9885
(0)	-10.9891
▁pq	-10.9891
ninit	-10.991
Mahmoud	-10.9922
Mishka	-10.9922
Ehab	-10.9922
Chris	-10.9922
[1010]	-10.993
▁'+';	-10.9941
[51]	-10.9949
1};	-10.9954
nfast	-11.0017
2[1])	-11.0068
ccw	-11.0083
rat	-11.0084
map	-11.0086
▁win	-11.0136
[++	-11.014
▁250)	-11.0151
▁cc	-11.016
▁1]))	-11.0199
▁qr	-11.0206
▁is	-11.0206
▁cek	-11.0209
[2][1]	-11.0209
bound	-11.0212
low	-11.0215
npr	-11.0231
next	-11.026
("-1")	-11.0278
pt	-11.0283
pre	-11.0286
toupper	-11.0287
one	-11.0304
Power	-11.0327
▁match	-11.0356
green	-11.0412
iste	-11.0433
▁calc	-11.0433
used	-11.0435
[105][105]	-11.0463
visit	-11.0469
nin	-11.0481
▁current	-11.0511
▁need	-11.053
▁30;	-11.0559
▁nums	-11.0583
color	-11.0583
ation	-11.0611
[20]	-11.0622
White	-11.0643
▁kol	-11.0723
5;	-11.0745
▁kk	-11.0746
▁db	-11.0806
▁lo	-11.0809
Akshat	-11.0832
▁keyboard	-11.0845
[0][2]	-11.0845
▁greater	-11.0861
▁MAXN	-11.0886
yes	-11.0891
▁2];	-11.091
[100010]	-11.0929
▁'9'	-11.0941
▁father	-11.0957
▁1].	-11.096
Black	-11.1024
[9]	-11.1037
et	-11.1053
(1);	-11.1054
:	-11.1077
ct	-11.1097
woman	-11.1104
()));	-11.1111
▁48	-11.1122
child	-11.1129
cont	-11.1163
yy	-11.1199
isprime	-11.121
Malvika	-11.122
(-1.0	-11.1223
!^^"	-11.1225
RU	-11.123
▁ql	-11.1233
▁color	-11.1248
▁digit	-11.1274
names	-11.1293
▁the	-11.1295
▁array	-11.1329
▁sub	-11.1378
nprint	-11.1435
nfre	-11.1446
▁"1	-11.1453
Oh	-11.1457
lo	-11.1478
[55]	-11.1482
▁'<')	-11.1499
▁"|	-11.1532
Max	-11.1537
▁'?'	-11.1537
▁{-1	-11.1553
▁distance	-11.1553
hi	-11.1565
nmark	-11.1579
prev	-11.1591
▁brr	-11.1608
▁grid	-11.1621
Impossible	-11.1624
Incorrect	-11.1624
▁hate	-11.1655
que	-11.1688
▁50	-11.1718
▁dig	-11.172
turn	-11.1762
]));	-11.1777
nrow	-11.1789
H	-11.1807
▁fin	-11.1809
CHA	-11.1834
nminn	-11.1841
6;	-11.1847
1))	-11.1851
▁ed	-11.1879
▁re	-11.1919
▁resp	-11.1946
rem	-11.1953
minn	-11.1968
▁'.'	-11.1973
▁best	-11.199
ac	-11.2012
ntest	-11.2022
▁make	-11.2026
graph	-11.2045
▁work	-11.2049
UL	-11.2056
▁'/')	-11.211
▁level	-11.215
DR	-11.2173
ex	-11.2177
ceil	-11.2179
[12]	-11.2187
[2][0]	-11.2198
[1][2]	-11.222
LU	-11.2232
npre	-11.2253
Danik	-11.2263
Grades	-11.2263
Anton	-11.2263
[101][101]	-11.2265
▁dir	-11.2268
LD	-11.2278
▁lower	-11.2279
mymap	-11.2285
RD	-11.229
▁point	-11.2296
ngoto	-11.23
(-1);	-11.2313
▁Arr	-11.2339
RE	-11.2353
▁'|'	-11.2376
Oct	-11.238
(10	-11.2392
};	-11.2414
]];	-11.2418
▁10000;	-11.2431
▁points	-11.2435
[50]	-11.2438
▁gu	-11.2448
▁up	-11.2457
position	-11.2476
▁1000000007	-11.2484
de	-11.2488
nput	-11.2488
][0])	-11.2489
etra	-11.2504
▁'5')	-11.2509
nleft	-11.2512
▁yu	-11.2522
half	-11.2524
▁cy	-11.2529
▁1.0	-11.2548
▁log	-11.2554
"\	-11.2574
▁"5"	-11.2591
▁1000000;	-11.2597
▁pref	-11.2623
come	-11.2629
2[0])	-11.2641
judge	-11.2656
▁suma	-11.2671
▁mult	-11.2695
▁MIN	-11.2698
Reality	-11.2712
Soul	-11.2712
IG	-11.2717
HER	-11.2718
Mind	-11.2722
unique	-11.2745
[10][10]	-11.2766
▁isprime	-11.2768
▁floor	-11.2794
][2];	-11.2796
10	-11.2804
▁11)	-11.2839
▁'*'	-11.2881
white	-11.2888
Div	-11.289
word	-11.2892
▁10]	-11.2915
Ans	-11.2915
▁cou	-11.2931
short	-11.2948
nmaxi	-11.2951
▁letter	-11.2956
1][	-11.297
▁sb	-11.2976
-9	-11.2982
us	-11.2986
▁(*	-11.3004
IM	-11.3027
▁used	-11.3037
[2][2]	-11.3046
Ron	-11.3047
sz	-11.3047
▁zero	-11.3055
▁sy	-11.3055
▁br	-11.3062
▁mas	-11.3069
▁found	-11.3074
cis	-11.3087
▁"?"	-11.3115
[102]	-11.3125
▁Number	-11.3135
days	-11.3149
8	-11.3182
Karen	-11.3183
Penny	-11.3183
Howard	-11.3183
▁arg	-11.3193
nB	-11.3207
▁1000000007)	-11.3219
▁book	-11.3224
maxi	-11.3225
▁"#.	-11.3225
▁po	-11.323
orange	-11.3242
▁can	-11.3247
on	-11.3248
Vasya	-11.3259
▁1]++;	-11.3284
▁coun	-11.3288
▁fl	-11.3288
nidx	-11.3299
sp	-11.3306
Misha	-11.3323
][3]	-11.3346
▁wh	-11.3399
Leonard	-11.3427
Rajesh	-11.3427
Sheldon	-11.3427
mat	-11.3467
se	-11.3478
yellow	-11.3506
nrem	-11.353
Space	-11.3533
sort	-11.3537
dx	-11.356
nct	-11.3571
nmid	-11.3577
1];	-11.3625
log	-11.3639
J	-11.364
▁fact	-11.3646
▁48);	-11.365
▁'8'	-11.3658
purple	-11.3677
▁con	-11.3677
▁mul	-11.3704
▁F	-11.3717
ndis	-11.3738
▁sieve	-11.3742
lower	-11.3746
table	-11.3758
mini	-11.3773
!	-11.3806
▁blue	-11.3843
▁hi	-11.3873
.";	-11.3892
[1].	-11.3898
▁ay	-11.3906
▁upper	-11.3915
▁big	-11.3929
[1000005]	-11.3933
Tie	-11.3935
nstep	-11.3936
▁valid	-11.3967
▁'[')	-11.3981
[2][	-11.3986
▁joy	-11.3993
▁tp	-11.3995
[60]	-11.4005
level	-11.4007
nlo	-11.4029
▁'>')	-11.4029
[201]	-11.4042
▁visit	-11.4051
▁isPrime	-11.4058
▁"+";	-11.4073
captain	-11.4111
▁tam	-11.4131
ITH	-11.4157
nread	-11.417
▁48)	-11.4182
▁dem	-11.4195
ck	-11.42
▁aa	-11.4205
▁1000000009;	-11.4245
▁13)	-11.4254
▁"+	-11.4269
naux	-11.4272
▁year	-11.4287
▁print	-11.4297
noutput	-11.4311
endl	-11.4316
rr	-11.4319
▁pw	-11.4348
▁length	-11.4355
▁days	-11.4356
▁maximum	-11.4358
cek	-11.4379
odec	-11.4395
▁22)	-11.4415
undefined	-11.4467
score	-11.4491
home	-11.4497
act	-11.4499
price	-11.4502
ta	-11.4508
points	-11.4516
▁ele	-11.4543
hash	-11.4553
freq	-11.4585
sign	-11.4592
[2]))	-11.4595
rlen	-11.4609
odd	-11.4612
er	-11.4618
▁"#	-11.4629
2[1]	-11.4662
Sum	-11.467
▁var	-11.4681
▁pri	-11.4681
."	-11.469
▁rec	-11.4701
▁tx	-11.4706
Alice	-11.4744
Equal	-11.4744
Bob	-11.4745
▁times	-11.4757
chair	-11.4759
buil	-11.4761
ncol	-11.477
▁lb	-11.4772
▁":"	-11.4792
▁tem	-11.4798
npriority	-11.4807
▁love	-11.4826
nvec	-11.4836
father	-11.4841
▁97;	-11.4846
nstack	-11.4846
▁def	-11.4866
▁comp	-11.4882
▁'7'	-11.4888
▁fun	-11.4892
plus	-11.4893
▁5);	-11.4905
mm	-11.4915
▁has	-11.4946
▁I	-11.4952
ncek	-11.4986
nprog	-11.4987
array	-11.4998
la	-11.5032
npq	-11.5033
dist	-11.5067
▁factor	-11.5075
nL	-11.5105
▁pic	-11.5109
pa	-11.5135
mn	-11.5185
compare	-11.5189
ed	-11.5226
▁good	-11.5251
▁even	-11.5253
solve	-11.5266
isPrime	-11.5271
nstringstream	-11.5273
▁ctr	-11.5279
▁head	-11.5279
nused	-11.529
▁'<'	-11.5306
Color	-11.5328
▁15;	-11.5336
▁no	-11.5353
[1]++;	-11.5374
)]	-11.5379
alpha	-11.5381
lol	-11.539
▁16)	-11.5403
▁1001;	-11.5408
[15]	-11.5408
test	-11.5411
4)	-11.5414
nmini	-11.5414
▁rep	-11.5443
nind	-11.5445
board	-11.5446
tream	-11.5451
9)	-11.5452
wh	-11.5453
tc	-11.5471
nfirst	-11.5507
▁be	-11.5515
myset	-11.5528
▁ff	-11.5541
▁med	-11.5541
▁se	-11.5543
nci	-11.5545
2));	-11.5546
nstart	-11.5556
▁dm	-11.5578
▁spf	-11.5579
▁unique	-11.5583
olve	-11.5593
Dasha	-11.5627
Masha	-11.5627
[55][55]	-11.5627
nright	-11.5652
nscore	-11.5666
▁1000000000;	-11.5671
▁down	-11.5688
to	-11.5718
base	-11.5771
backward	-11.5777
nmm	-11.5778
man	-11.5794
▁exp	-11.5794
▁180	-11.5809
fuel	-11.5869
)((	-11.587
3++;	-11.5875
till	-11.5887
▁25)	-11.5914
nbase	-11.5917
▁ta	-11.5941
major	-11.5941
▁'('	-11.5945
▁gap	-11.5954
minor	-11.5961
▁tree	-11.5963
[25]	-11.5963
gap	-11.5975
nMax	-11.5984
▁goal	-11.5988
team	-11.6001
▁240	-11.6007
To	-11.6019
▁"#"	-11.6033
▁'#'	-11.6035
▁green	-11.6039
▁rs	-11.6056
▁put	-11.6085
nums	-11.6088
par	-11.6103
tab	-11.6118
).	-11.6119
Arr	-11.6121
forward	-11.6122
power	-11.6133
▁msk	-11.6144
type	-11.6167
nprime	-11.6203
▁'-';	-11.6211
nfound	-11.6225
match	-11.6235
▁position	-11.6238
CD	-11.6243
▁22;	-11.6247
▁97	-11.6269
en	-11.6272
▁weak	-11.6272
1(	-11.6275
▁cod	-11.6284
valid	-11.6292
▁'>'	-11.6295
root	-11.6361
▁2));	-11.6366
▁odd	-11.6374
▁'['	-11.6375
▁set	-11.6377
▁move	-11.6406
'])	-11.6428
▁3])	-11.6433
▁items	-11.645
▁60)	-11.6455
Hermione	-11.6504
that	-11.6512
3[	-11.6515
▁store	-11.6522
letter	-11.6589
TIE	-11.6596
contest	-11.6597
[100][100]	-11.6599
2];	-11.6606
▁ll	-11.6624
▁'\0'	-11.6661
nC	-11.6672
po	-11.668
lucky	-11.6685
edge	-11.6697
▁cup	-11.6719
▁psum	-11.6735
▁ada	-11.6752
ndiff	-11.6768
nG	-11.6773
▁lim	-11.6773
▁map	-11.6783
break	-11.6795
rs	-11.6818
8;	-11.6827
node	-11.6848
un	-11.6852
ut	-11.6858
both	-11.6859
ube	-11.6871
digits	-11.6885
nex	-11.6885
▁cap	-11.6899
nQ	-11.6917
tp	-11.6918
moves	-11.6922
[200005]	-11.6941
ra	-11.6943
[2005]	-11.6947
FS	-11.6956
nfill	-11.6971
nadj	-11.6973
current	-11.698
▁Find	-11.698
▁lenb	-11.6981
DP	-11.6985
▁tar	-11.7012
[2001]	-11.7025
▁24;	-11.7034
flg	-11.7051
▁req	-11.7053
▁numbers	-11.7073
need	-11.7084
nR	-11.7092
nT	-11.7096
[500]	-11.7112
▁change	-11.7129
▁key	-11.7153
▁goto	-11.718
▁cad	-11.7185
▁7);	-11.7186
▁winner	-11.7188
can	-11.7188
(4);	-11.7191
▁all	-11.7215
▁pi	-11.7224
[1	-11.7225
fl	-11.7232
jj	-11.7242
joy	-11.7246
▁cot	-11.7269
▁1000000009	-11.7276
▁itr	-11.7294
▁su	-11.7294
vowel	-11.73
[4])	-11.7305
▁Rozdil	-11.7307
UR	-11.7312
▁100001;	-11.7316
[200001]	-11.7337
▁101;	-11.7351
▁"="	-11.7351
zero	-11.7353
ngcd	-11.7358
permut	-11.7375
[4][2]	-11.7387
▁fi	-11.7392
▁lucky	-11.74
▁menor	-11.7401
▁flg	-11.7407
ncou	-11.7436
tu	-11.7451
down	-11.7452
▁bit	-11.7463
)))	-11.7468
1));	-11.7503
main	-11.7505
[2].	-11.753
)));	-11.7539
oo	-11.7542
Par	-11.7549
▁visited	-11.7549
gets	-11.7561
▁from	-11.7581
hitung	-11.7587
▁sqr	-11.7592
div	-11.7605
▁list	-11.7623
nfather	-11.7626
▁dat	-11.763
▁hash	-11.7643
▁dep	-11.7645
strange	-11.767
▁tab	-11.7679
ntrans	-11.7685
▁3]	-11.7687
▁sumb	-11.7747
▁en	-11.775
sub	-11.7755
nhash	-11.7766
am	-11.7776
▁rl	-11.7808
NG	-11.7808
▁month	-11.7821
book	-11.7828
kol	-11.7835
▁flog	-11.7843
▁plus	-11.7855
▁par	-11.7878
▁tim	-11.7895
Number	-11.7909
▁dd	-11.7918
▁ck	-11.792
▁26)	-11.7922
▁28	-11.7932
mxm	-11.7945
um	-11.7949
▁25;	-11.7975
nsol	-11.7981
▁txt	-11.7993
10;	-11.7994
std	-11.8003
TESTS	-11.8007
nfreq	-11.8028
PH	-11.8054
lfp	-11.808
ce	-11.8107
▁105;	-11.8113
(8	-11.8119
[111]	-11.8121
▁"3"	-11.8124
▁sq	-11.8126
▁92	-11.8129
nway	-11.8152
output	-11.8152
2])	-11.8162
▁gr	-11.8164
dy	-11.8169
ndist	-11.8173
mi	-11.8181
nkol	-11.8211
▁jj	-11.822
▁md	-11.8227
pri	-11.823
spf	-11.8238
▁poww	-11.8246
dg	-11.8247
▁21)	-11.8249
▁100);	-11.8277
nre	-11.8284
▁side	-11.83
▁86400	-11.8305
nmatch	-11.8312
▁hasil	-11.8326
(*	-11.8328
▁red	-11.8328
▁la	-11.8356
▁rat	-11.8364
whichPosn	-11.8422
fantasy	-11.8453
Ciel	-11.8453
[110][110]	-11.8455
list	-11.8458
mber	-11.8476
]][	-11.8493
err	-11.8494
▁TESTS	-11.85
▁'3')	-11.8504
▁three	-11.8518
▁cx	-11.8547
▁lca	-11.8553
▁matches	-11.857
nse	-11.8596
▁myset	-11.8623
▁iter	-11.864
[200000	-11.8644
▁65	-11.8652
▁moves	-11.8654
vv	-11.8677
ore	-11.8677
▁cr	-11.8679
▁board	-11.8701
▁20	-11.8701
nvalid	-11.8701
▁save	-11.8725
▁pt	-11.8726
▁1000000000	-11.8745
INF	-11.8758
▁Z	-11.8763
answer	-11.8767
exist	-11.877
7;	-11.8775
Min	-11.882
▁minimum	-11.8844
[27]	-11.8863
Hanako	-11.8869
▁!(	-11.888
mask	-11.888
ava	-11.8897
nsy	-11.8897
nit	-11.8899
dep	-11.8931
[100000	-11.8938
tial	-11.8945
ign	-11.896
▁pp	-11.896
(5	-11.8988
all	-11.9004
▁cycle	-11.9034
app	-11.9043
'))	-11.9043
rest	-11.9065
[2]++;	-11.9107
here	-11.9113
▁xay	-11.9144
▁mins	-11.915
▁nl	-11.915
▁chest	-11.917
ssor	-11.9175
nsm	-11.9197
nun	-11.9199
▁'/'	-11.92
▁96	-11.9202
▁97)	-11.9242
▁dr	-11.9246
▁10000000;	-11.9265
▁Count	-11.9266
udmoves	-11.928
rlmoves	-11.9286
notes	-11.9288
[1000006]	-11.9293
HARD	-11.9304
EASY	-11.9304
zxcvbnm	-11.9304
sdfghjkl	-11.9305
impossible	-11.9309
search	-11.9313
ncurrent	-11.9315
▁"|#.	-11.9319
▁999999	-11.9331
18	-11.9339
Int	-11.9343
▁divis	-11.9345
▁50)	-11.9351
▁item	-11.9374
▁"25	-11.9375
ada	-11.9382
▁divisor	-11.9391
go	-11.9394
▁fy	-11.9396
tri	-11.9407
▁both	-11.9411
▁Vas	-11.9413
▁mov	-11.9438
▁hy	-11.9441
▁weight	-11.945
▁clock	-11.9453
be	-11.946
adj	-11.9468
▁le	-11.9473
▁extra	-11.9485
▁prices	-11.9505
▁"2	-11.9509
yu	-11.953
fs	-11.9533
satu	-11.9545
high	-11.9581
▁fx	-11.959
▁parent	-11.9604
dem	-11.9623
▁final	-11.9625
((3	-11.9626
grid	-11.964
ff	-11.9653
pr	-11.9682
[0]]	-11.9687
▁'+'	-11.9694
ter	-11.9696
▁36	-11.9697
▁edges	-11.9708
ha	-11.9736
ay	-11.9744
diag	-11.9756
qwertyuiop	-11.9759
[205]	-11.9759
▁"1/1"	-11.9781
▁LCM	-11.9785
▁men	-11.9786
minimum	-11.9786
▁rot	-11.979
static	-11.9792
nsoroban	-11.9803
light	-11.9804
▁'!')	-11.9816
▁'2')	-11.9827
▁'=')	-11.983
▁lead	-11.9834
▁100000000	-11.9841
nadd	-11.9852
[120]	-11.9852
▁123;	-11.9866
ary	-11.9873
▁root	-11.9889
▁atoi	-11.9891
▁Ans	-11.9919
25	-11.9928
nlow	-11.9933
▁1000000)	-11.9941
▁coins	-11.9981
▁soma	-11.9986
mo	-11.9993
nneed	-11.9997
▁path	-12.0001
▁biceps	-12.0008
[5]);	-12.0023
▁rest	-12.0023
gu	-12.0028
▁done	-12.003
][0][	-12.006
su	-12.0081
▁el	-12.0081
▁180)	-12.0081
▁pm	-12.009
cons	-12.0093
▁atk	-12.0106
▁pass	-12.0112
▁500;	-12.0123
▁360	-12.0125
▁"-";	-12.0151
7)	-12.0172
▁pro	-12.0175
▁oo	-12.0181
AB	-12.0221
so	-12.0224
add	-12.0225
os	-12.0228
Nikita	-12.0235
Olya	-12.0235
Danil	-12.0235
▁"***"	-12.0242
nD	-12.0243
▁1000000	-12.0244
▁"1/2"	-12.0257
status	-12.0259
▁search	-12.0259
▁90)	-12.0273
nsx	-12.029
▁"<"	-12.0308
|)"	-12.0309
isok	-12.0309
▁contador	-12.0311
▁'^')	-12.0326
▁game	-12.0338
primes	-12.0354
▁in	-12.0368
▁"4"	-12.0393
▁">"	-12.041
▁bound	-12.042
▁seq	-12.0435
nflg	-12.0447
iz	-12.0449
0);	-12.0453
▁hor	-12.0455
▁exit	-12.0471
▁pl	-12.0476
▁Next	-12.0479
▁mai	-12.0483
[505]	-12.0488
▁nCr	-12.0494
▁_	-12.0499
▁'|')	-12.0506
▁23)	-12.0559
dig	-12.0561
▁slen	-12.0564
▁1000)	-12.0572
▁tm	-12.0574
▁money	-12.0591
▁100000	-12.06
▁lena	-12.0606
▁1)));	-12.0632
[100	-12.0648
▁limit	-12.0657
nMin	-12.0668
dest	-12.0683
ver	-12.0684
▁isok	-12.069
▁ones	-12.069
best	-12.0722
isgro	-12.0746
▁'0']	-12.0747
▁"1/3"	-12.0758
▁"2/3"	-12.0758
▁"5/6"	-12.0758
▁gl	-12.0767
subtractions	-12.0785
none	-12.0786
nbb	-12.0786
▁Input	-12.0802
▁lol	-12.0811
▁122)	-12.0817
[2000]	-12.083
ndem	-12.0832
poly	-12.0842
▁rta	-12.0852
▁fuel	-12.0853
()))	-12.0854
▁31;	-12.0876
eat	-12.0884
▁type	-12.0887
gr	-12.089
[3][	-12.09
nodd	-12.0907
3.	-12.091
sx	-12.0962
▁hp	-12.0967
▁alpha	-12.0971
nhi	-12.0975
▁sign	-12.0979
▁vs	-12.0987
(1.0	-12.0989
ite	-12.1012
loc	-12.1065
▁ry	-12.1068
nsuma	-12.1084
|";	-12.109
▁(3	-12.1092
▁letters	-12.1117
far	-12.1128
iter	-12.1159
_1	-12.1164
▁qy	-12.117
▁360;	-12.1171
▁1.0)	-12.1173
▁numOf	-12.1173
▁qq	-12.1201
('-')	-12.1207
▁lessons	-12.1209
Bulbasaur	-12.1261
▁exist	-12.1274
thur	-12.1279
▁mask	-12.1285
▁students	-12.1287
fri	-12.1288
nX	-12.13
cup	-12.1303
Len	-12.1307
cr	-12.1308
fact	-12.1314
▁blyat	-12.1314
[1000	-12.1318
▁solution	-12.1336
npar	-12.134
ajout	-12.1348
▁hb	-12.1349
byte	-12.1351
▁box	-12.1364
▁nex	-12.1396
BA	-12.1397
▁MN	-12.1399
▁inv	-12.1402
▁that	-12.1404
▁500	-12.1427
ous	-12.1432
▁cards	-12.1445
4);	-12.1457
calc	-12.1465
nplayers	-12.1468
ndays	-12.147
[400]	-12.1484
[10005]	-12.1488
ad	-12.1488
dfs	-12.1498
▁target	-12.1502
▁ori	-12.1515
▁((1	-12.1531
numbers	-12.1535
numberOfStudents	-12.1536
Num	-12.1538
▁24	-12.1546
sy	-12.1555
(360	-12.1562
▁200	-12.1568
▁bl	-12.157
nara	-12.1588
nvisit	-12.159
▁curlower	-12.1591
▁(__	-12.1594
isa	-12.1595
▁colors	-12.1609
▁MX	-12.1634
Ju	-12.1642
▁(1);	-12.1679
nhave	-12.1688
▁'_._'	-12.1703
tt	-12.1718
▁pa	-12.1735
(4	-12.1777
▁250	-12.1784
(7	-12.1795
ve	-12.1811
[5005]	-12.1817
[128]	-12.1822
popcount	-12.1841
']['	-12.1843
_._./"	-12.1844
▁slogan	-12.1847
ms	-12.1852
▁Qr	-12.1867
nyu	-12.1878
▁star	-12.1908
▁ac	-12.191
fixed	-12.1916
▁remove	-12.1927
▁(7	-12.193
]].	-12.194
▁mo	-12.1941
square	-12.1943
▁6);	-12.1944
prog	-12.1951
inp	-12.1951
mas	-12.1951
edges	-12.1954
big	-12.1964
rday	-12.1968
▁shu	-12.1981
▁atkm	-12.1982
from	-12.1983
▁cell	-12.1986
▁banyak	-12.1987
▁levels	-12.1989
abc	-12.2
dd	-12.2007
▁"")	-12.2018
pw	-12.2029
▁hm	-12.203
▁11	-12.2033
[200000]	-12.204
-"	-12.2047
al	-12.2049
nsz	-12.2059
hh	-12.2062
ate	-12.2064
▁qua	-12.2064
rt	-12.2082
false	-12.2083
▁maxy	-12.2084
▁maxm	-12.2084
nlol	-12.2091
LO	-12.2101
▁area	-12.2106
▁chk	-12.2108
tem	-12.2147
'];	-12.2155
(10)	-12.2184
]]--;	-12.2205
as	-12.2213
10);	-12.2238
▁1][0])	-12.226
ial	-12.2291
read	-12.2299
nfuck	-12.2304
npass	-12.2307
startx	-12.2308
ab	-12.2327
▁status	-12.2347
lessons	-12.2364
my	-12.2375
Ann	-12.2381
mmap	-12.2381
-6	-12.2386
-1	-12.2401
Elephant	-12.2405
Bear	-12.2409
erate	-12.2409
("0")	-12.2409
sert	-12.2416
("1")	-12.2418
[210]	-12.2424
▁toggle	-12.2452
▁rows	-12.2469
[20	-12.2481
(8);	-12.2489
nInput	-12.2491
nxx	-12.2499
▁capacity	-12.2515
req	-12.2531
numb	-12.2537
nresp	-12.2538
even	-12.2569
dir	-12.2574
ndata	-12.2575
money	-12.2578
skill	-12.2583
newdp	-12.2584
nsieve	-12.259
store	-12.2598
good	-12.2609
50	-12.2616
neo	-12.2621
[150]	-12.2626
)1	-12.2633
buff	-12.2633
▁light	-12.2638
▁pot	-12.2639
ER	-12.264
nuts	-12.2648
▁begin	-12.2659
tstep	-12.2674
▁pe	-12.2676
▁write	-12.2714
▁posy	-12.2716
▁30)	-12.2724
[20000]	-12.2725
atk	-12.2737
▁round	-12.2753
▁siz	-12.2769
▁-2;	-12.2776
▁sm	-12.2785
nbr	-12.2801
-";	-12.2826
[1]))	-12.2829
▁"4	-12.2832
bb	-12.2833
neven	-12.284
]]]	-12.2859
▁asd	-12.2867
minx	-12.287
nsu	-12.2895
marks	-12.2899
(3);	-12.2909
▁99999999	-12.2911
▁same	-12.2915
▁(4	-12.2916
than	-12.2919
ur	-12.292
fb	-12.2937
▁mymap	-12.2973
nmy	-12.299
It	-12.3001
▁0.5	-12.3009
][4]	-12.3011
ctr	-12.3015
▁exe	-12.3021
npic	-12.3021
BigInteger	-12.303
Koyomi	-12.303
pwr	-12.303
Found	-12.3032
▁dot	-12.3033
[1][2])	-12.3042
ULL	-12.3048
▁1005;	-12.3051
("")	-12.3052
▁del	-12.3057
▁loss	-12.3059
▁200000)	-12.3059
(12)	-12.3066
nrotate	-12.3068
▁answ	-12.3078
dis	-12.3092
nnumberOf	-12.3095
hor	-12.3103
criba	-12.3134
▁'^'	-12.3142
▁buf	-12.3148
▁password	-12.315
▁old	-12.3165
▁vetor	-12.317
nhitung	-12.3189
3372036854775807	-12.319
ly	-12.3194
nall	-12.3197
nlike	-12.3209
nzero	-12.3211
(((	-12.3212
[10010]	-12.3219
owel	-12.3231
▁32)	-12.3234
colom	-12.3245
parent	-12.3249
nvalue	-12.3258
[1000000]	-12.3266
▁trees	-12.3285
raw	-12.3292
bit	-12.3295
▁dim	-12.33
nstarty	-12.3305
nprimes	-12.331
winner	-12.3322
pass	-12.3334
nP	-12.3339
curlower	-12.334
hasil	-12.3344
nstate	-12.3365
have	-12.337
remainder	-12.3377
save	-12.3383
▁endy	-12.3403
rd	-12.3407
bs	-12.3413
asphalt	-12.3413
cy	-12.3435
▁raw	-12.3442
cc	-12.3448
▁sec	-12.3452
▁ab	-12.3454
▁9999999	-12.3457
▁clo	-12.3471
-8	-12.349
1_	-12.3506
▁half	-12.3528
nlist	-12.3529
▁sc	-12.3532
▁nuts	-12.3541
aa	-12.3579
bak	-12.358
ncolor	-12.3591
▁act	-12.3593
nwork	-12.3597
▁"4";	-12.3602
▁minus	-12.3607
counts	-12.3609
▁gc	-12.3624
2["	-12.3633
nN	-12.3643
we	-12.365
il	-12.3654
nstartx	-12.3656
ncal	-12.3658
▁**	-12.3681
▁jumlah	-12.3683
▁yes	-12.3685
▁pv	-12.3691
NEITHER	-12.3697
Alien	-12.3697
Sort	-12.3697
Factor	-12.3698
licz	-12.3699
possible	-12.3701
searchres	-12.3703
▁'-'	-12.3704
slot	-12.3713
nV	-12.3718
18)	-12.3727
▁sup	-12.3728
nboo	-12.3729
▁loct	-12.3732
eaten	-12.374
ls	-12.3744
▁whichPosn	-12.3748
ndir	-12.3751
[11][11]	-12.3758
▁'6')	-12.3769
TO	-12.3773
▁salt	-12.3773
▁220;	-12.3773
tam	-12.3777
[4][	-12.3779
pp	-12.3791
▁Ql	-12.3794
▁lst	-12.3794
▁player	-12.3803
▁'}')	-12.3804
pal	-12.3804
nhigh	-12.3813
▁huiwen	-12.3818
nmi	-12.3825
nface	-12.3831
kk	-12.3832
▁loc	-12.3854
nada	-12.3855
▁card	-12.3883
[1000001]	-12.3884
▁110;	-12.3885
▁miny	-12.3889
lcm	-12.389
Colo	-12.3892
▁bills	-12.3892
▁atky	-12.3893
▁(-1	-12.3922
▁pal	-12.3924
nore	-12.3929
▁nam	-12.3942
▁sw	-12.3948
86400	-12.3951
distance	-12.3959
active	-12.3962
MX	-12.3965
currnum	-12.3971
2[0];	-12.3976
[4][4]	-12.3986
npo	-12.3989
cap	-12.4009
▁matriz	-12.4012
▁10000	-12.4013
[2][1])	-12.4014
▁palindrome	-12.402
▁summ	-12.4035
cx	-12.4048
ones	-12.4048
▁starty	-12.4057
▁gg	-12.4069
▁(8	-12.4075
64	-12.4078
ud	-12.4083
▁zz	-12.4099
GR	-12.4099
▁1][2])	-12.4106
chr	-12.4108
point	-12.411
▁ha	-12.4117
1["	-12.4128
nchange	-12.414
ong	-12.4149
ax	-12.415
nsup	-12.4156
nid	-12.4159
gh	-12.416
[10	-12.4197
▁have	-12.4199
nfo	-12.4206
nfun	-12.4233
vs	-12.4235
th	-12.4258
WBWBWBW	-12.4275
ya	-12.4276
[10001]	-12.4294
Way	-12.4299
▁sheets	-12.4307
encont	-12.433
▁team	-12.4331
lu	-12.4339
▁endx	-12.4344
▁sumr	-12.4362
▁'2'	-12.4372
▁1.0))	-12.4377
[35]	-12.4381
layer	-12.4385
med	-12.4391
▁let	-12.4401
Delete	-12.4411
aeiou	-12.4411
[1001][1001]	-12.4413
nmaxn	-12.4414
Alex	-12.4417
(2);	-12.4446
▁amount	-12.445
esp	-12.4459
qmarks	-12.4465
[1100]	-12.4467
▁numberOf	-12.4473
▁qpow	-12.4492
XXX	-12.4499
nkk	-12.4499
▁0}	-12.4504
▁skills	-12.4505
[40]	-12.451
▁bottles	-12.451
▁jum	-12.4511
urs	-12.452
▁Pi	-12.4529
▁"7";	-12.4529
▁poss	-12.4534
▁CUR	-12.4544
▁edge	-12.4549
Prime	-12.4554
0.0)	-12.4564
▁counts	-12.4569
▁tabl	-12.4573
▁ci	-12.4586
▁tag	-12.4587
▁node	-12.4589
▁bottom	-12.4612
beg	-12.462
▁2000;	-12.462
njudge	-12.462
▁'9';	-12.4628
▁speed	-12.4647
▁ver	-12.4649
▁((2	-12.4653
1[2]	-12.4664
nbanyak	-12.467
ame	-12.4675
▁by	-12.4677
▁sh	-12.4685
ncoun	-12.4698
notup	-12.4709
maximum	-12.4711
▁ganjil	-12.4716
round	-12.4738
▁votes	-12.4738
▁fre	-12.4747
▁participants	-12.475
[3]++;	-12.4751
nred	-12.4752
▁'0'))	-12.4764
▁hang	-12.4768
▁18	-12.4773
▁spec	-12.4775
dot	-12.4791
▁nxt	-12.4802
▁steps	-12.4833
[300]	-12.4846
"))	-12.4846
▁captain	-12.4873
rand	-12.4879
▁(9	-12.4887
sec	-12.4892
▁(-1)	-12.4904
▁32	-12.4919
][1][	-12.4924
▁neg	-12.4925
#.#.#.#.#.#.	-12.4935
nrest	-12.4956
▁vet	-12.4968
▁"-"	-12.497
asd	-12.4972
nZ	-12.498
[5])	-12.4983
letters	-12.4998
▁words	-12.5029
▁rx	-12.5047
▁pair	-12.5056
nstore	-12.5102
key	-12.5107
[5001]	-12.5124
▁indx	-12.5146
ello	-12.5152
▁tr	-12.5166
▁acc	-12.5172
▁di	-12.5176
maxs	-12.5177
fffffff	-12.518
zhuangtai	-12.518
showpoint	-12.518
klmnopqrstuvwxyz	-12.518
[8][8]	-12.5182
[200][200]	-12.5183
▁1000003;	-12.5191
lose	-12.5194
▁59)	-12.5197
hel	-12.5198
▁pause	-12.5199
(':')	-12.5199
[13]	-12.5205
]]);	-12.5228
▁person	-12.5235
▁ms	-12.5242
▁te	-12.5246
▁dc	-12.5262
▁vowels	-12.5262
▁27)	-12.5271
▁120;	-12.5274
▁NULL	-12.5291
▁large	-12.53
▁1}_._	-12.53
▁inches	-12.5304
[2002]	-12.5305
▁bob	-12.5311
nmulti	-12.5317
▁qtb	-12.5327
▁off	-12.5344
▁games	-12.5349
da	-12.536
▁200001	-12.5362
▁(0)	-12.5368
▁angle	-12.5372
pd	-12.5372
▁(26	-12.5386
▁chris	-12.5392
nprevious	-12.5393
nike	-12.5403
▁lens	-12.5403
_0	-12.5428
nup	-12.5433
▁way	-12.5436
▁posx	-12.5449
▁ope	-12.5455
▁numb	-12.5459
▁crew	-12.5468
nout	-12.5503
command	-12.552
br	-12.5526
▁ca	-12.5541
▁maxl	-12.5542
▁depth	-12.5544
Hash	-12.5549
▁ad	-12.5549
Home	-12.5554
fingers	-12.5554
nmonth	-12.5559
Possib	-12.5569
gesture	-12.5574
path	-12.5579
▁rank	-12.5579
4++;	-12.558
compute	-12.559
▁compute	-12.5591
Primes	-12.5592
isV	-12.5595
▁dos	-12.5596
ca	-12.5603
ope	-12.5611
stu	-12.5613
▁home	-12.5614
▁values	-12.5614
msk	-12.5623
nno	-12.5638
el	-12.5642
▁1][1])	-12.5643
cad	-12.565
9);	-12.5658
▁mxv	-12.5662
XX	-12.5668
nhas	-12.567
--])	-12.5682
con	-12.5682
RA	-12.569
Count	-12.5716
▁-1);	-12.5719
sol	-12.5732
ames	-12.574
nas	-12.5758
▁50;	-12.577
▁palin	-12.5776
(6)	-12.5778
ntop	-12.578
nnumber	-12.5784
wt	-12.5791
▁cp	-12.5808
rend	-12.5826
nupdate	-12.5839
ntwo	-12.584
▁ysum	-12.5844
[1][0])	-12.585
chess	-12.586
maxN	-12.5862
▁va	-12.5889
fix	-12.589
njj	-12.5893
nyy	-12.5893
fail	-12.5904
[1000][100	-12.5911
spec	-12.5934
taken	-12.5939
vet	-12.5941
ndif	-12.5946
▁maxa	-12.5957
▁forward	-12.5982
▁bal	-12.5987
ol	-12.5994
side	-12.6005
rado	-12.6009
nedges	-12.601
nCount	-12.6011
▁2]);	-12.6013
TOWARDS	-12.6013
[27000]	-12.6013
Posution	-12.6013
[100007]	-12.6014
[50][50]	-12.6014
▁center	-12.6014
Letter	-12.6015
currcase	-12.6015
.0	-12.6017
verse	-12.6018
▁towels	-12.6018
Stone	-12.6022
mili	-12.6026
00005;	-12.6026
brr	-12.6028
▁foo	-12.6035
▁29	-12.6039
ndiag	-12.6041
▁'3'	-12.6042
ncap	-12.6047
▁4]	-12.6047
-7	-12.605
▁decrypt	-12.6053
Mul	-12.6056
▁rotate	-12.606
▁cntb	-12.606
▁ansy	-12.6065
[5000]	-12.6072
ped	-12.6083
pq	-12.6083
[100100]	-12.6083
▁jumlahg	-12.6085
▁fill	-12.609
nfact	-12.609
nbest	-12.61
8")	-12.6108
▁column	-12.6115
npp	-12.6117
▁wt	-12.6119
chars	-12.6128
ap	-12.613
▁(~	-12.6136
neg	-12.6138
▁dia	-12.6141
eight	-12.6153
(1)	-12.616
Str	-12.6161
cond	-12.6168
▁file	-12.6172
IN	-12.6177
numberOfElements	-12.6196
▁modd	-12.6197
▁Cmp	-12.6199
▁offset	-12.6212
▁previous	-12.6223
▁1]]++;	-12.6226
▁stone	-12.6226
▁was	-12.6236
▁wei	-12.6246
▁deg	-12.6248
(((3	-12.6249
▁spyke	-12.6249
▁cakes	-12.6251
▁19	-12.6256
▁pairt	-12.6262
Au	-12.6264
▁cel	-12.6289
▁{}	-12.6308
Pos	-12.6343
▁"1/6"	-12.6347
▁record	-12.6353
▁ctx	-12.6359
[0]['	-12.636
▁bisa	-12.6366
('0')	-12.6369
floor	-12.6375
tar	-12.6383
[15000	-12.6399
▁misha	-12.6403
terkecil	-12.6403
100	-12.6408
nsecond	-12.642
▁numOps	-12.6422
(180	-12.6423
]++	-12.643
1[3]	-12.6437
primeFactures	-12.6438
▁jarak	-12.6451
NE	-12.6453
jarak	-12.6465
▁do	-12.6472
[7	-12.6475
sushu	-12.6486
items	-12.6495
_8	-12.6497
▁take	-12.6503
▁ep	-12.6504
▁dest	-12.6506
rank	-12.6511
[0]][0]	-12.6511
palindrome	-12.6513
cha	-12.6515
igu	-12.6518
NS	-12.6523
ndeg	-12.6524
▁sumA	-12.6524
▁func	-12.6534
▁ww	-12.6538
game	-12.6548
▁remainder	-12.6559
▁yf	-12.6564
▁5))	-12.6566
nfr	-12.6573
per	-12.6584
nimpar	-12.6588
flog	-12.6592
mult	-12.6603
▁1)))	-12.6621
501;	-12.6623
nCr	-12.6631
stones	-12.6636
ace	-12.6639
▁ats	-12.664
3]	-12.6643
▁24)	-12.6644
▁fr	-12.6669
▁comb	-12.6671
▁1][2]	-12.6676
[1][1])	-12.6701
ele	-12.6711
[-1]	-12.6714
eg	-12.6716
1000001;	-12.6725
▁pas	-12.6729
▁U	-12.6731
dat	-12.6776
nfix	-12.6785
ep	-12.6792
5)	-12.6797
▁(-	-12.6812
▁sumB	-12.6824
opt	-12.6826
▁bool	-12.6831
])]++;	-12.6832
▁1][2]))	-12.6836
[(	-12.685
narg	-12.6851
nsoma	-12.6854
done	-12.6854
▁modex	-12.6865
sorted	-12.6871
▁dg	-12.6883
pple	-12.6897
che	-12.6901
7);	-12.6901
Mina	-12.6911
▁32767)	-12.6922
Contest	-12.6923
require	-12.6923
Finite	-12.6923
Gym	-12.6923
Union	-12.6923
road	-12.6924
nam	-12.6924
▁127)	-12.6925
function	-12.6926
ci	-12.6927
ostringstream	-12.6927
[1005][1005]	-12.6929
▁2000000;	-12.6931
started	-12.6939
ulate	-12.694
▁97]++;	-12.6941
nY	-12.6944
[100009]	-12.6948
▁'_')	-12.6964
ost	-12.6965
nrlmoves	-12.6966
[2][0])	-12.6971
nudmoves	-12.6975
▁2147483647)	-12.6979
rot	-12.6985
nspf	-12.6986
▁']')	-12.6997
OT	-12.7001
▁query	-12.7006
▁occ	-12.7016
mul	-12.7019
▁16	-12.7024
▁lc	-12.7033
▁linha	-12.7048
coun	-12.705
▁fastexp	-12.7052
▁tims	-12.7052
▁discounts	-12.7061
▁vest	-12.7071
▁conv	-12.7073
item	-12.7084
and	-12.7087
▁ways	-12.7101
ncontador	-12.7102
▁distanc	-12.7112
32	-12.7113
▁19)	-12.7128
nes	-12.7134
▁newsum	-12.7137
▁1000000000)	-12.7143
▁ssj	-12.7188
▁999999999	-12.7198
▁fim	-12.7214
▁oven	-12.7221
eque	-12.7232
▁1]]	-12.7235
ou	-12.7237
▁plen	-12.7238
▁'6'	-12.7238
▁dict	-12.724
▁present	-12.7246
cod	-12.7246
nedge	-12.7248
frest	-12.725
sh	-12.7254
▁Cnt	-12.7258
▁Blue	-12.7266
▁ref	-12.7268
has	-12.7268
▁lie	-12.728
arg	-12.73
nsb	-12.7311
▁cmd	-12.7321
IO	-12.7324
bus	-12.7348
ement	-12.7348
▁zy	-12.7356
▁compare	-12.7366
8"	-12.7367
xxx	-12.7372
▁stones	-12.7389
gl	-12.7397
Next	-12.7402
▁fff	-12.7411
▁state	-12.7411
▁(-1);	-12.7414
3[0]	-12.7414
▁chess	-12.7432
▁cycles	-12.7434
Ma	-12.7438
bacterias	-12.7445
pointer	-12.7454
matriz	-12.7459
participants	-12.746
gov	-12.7463
depth	-12.7463
prefix	-12.7467
mishka	-12.7469
numOps	-12.7471
poww	-12.7473
misha	-12.7475
▁8);	-12.7483
01	-12.7486
SS	-12.749
target	-12.7491
'6'	-12.7491
minus	-12.7493
_4	-12.7495
Md	-12.7511
interval	-12.7519
▁3.14159	-12.7525
sm	-12.7527
▁active	-12.7531
Sub	-12.7532
8)	-12.7534
▁fac	-12.7534
indx	-12.7541
boxes	-12.7563
▁currnum	-12.757
tx	-12.7574
Now	-12.758
----------	-12.7587
▁pb	-12.7587
()]	-12.7598
▁xmax	-12.7601
over	-12.7607
cdays	-12.7614
ganjil	-12.7618
coins	-12.762
qta	-12.7621
▁alt	-12.7624
te	-12.7632
▁numer	-12.7638
colors	-12.7646
nnext	-12.7648
trees	-12.7654
fgh	-12.7661
[6	-12.7663
2337203685477580	-12.769
▁square	-12.7703
▁den	-12.7703
▁47	-12.7704
mode	-12.7712
▁sta	-12.7725
tim	-12.7731
nbook	-12.7742
rla	-12.7747
he	-12.7757
fo	-12.7794
▁(--	-12.7803
▁64	-12.7813
%	-12.782
post	-12.782
cycle	-12.7837
nrs	-12.7873
etter	-12.7892
change	-12.7897
▁small	-12.7902
▁ey	-12.7903
alph	-12.7907
Mod	-12.7908
nvv	-12.7909
MOD	-12.7913
▁cha	-12.7913
INPUT	-12.7922
OUTPUT	-12.7922
Infinite	-12.7922
▁DELTA	-12.7923
[305]	-12.7923
▁least	-12.7923
▁1000010;	-12.7924
state	-12.793
▁INFF	-12.7934
segment	-12.7938
[1]]	-12.7938
▁4000000	-12.7943
Pre	-12.7944
▁lg	-12.7944
[19]	-12.7948
▁220)	-12.7949
▁remain	-12.7953
nmerge	-12.7954
ive	-12.7958
amounts	-12.7958
(97	-12.7966
carry	-12.7977
[10000000]	-12.798
[200010]	-12.7981
tmo	-12.7982
ncomp	-12.7987
▁"8"	-12.7991
cycles	-12.7998
[1002]	-12.8005
▁ite	-12.801
▁inicio	-12.8012
▁reqrec	-12.8014
▁Counter	-12.802
ts	-12.8024
▁shit	-12.8029
occur	-12.8032
ak	-12.8033
▁100005;	-12.8033
block	-12.8033
▁emm	-12.8036
splay	-12.8039
1--	-12.8039
Dist	-12.8044
▁pod	-12.8047
▁55;	-12.8059
[31]	-12.8059
▁quotient	-12.8064
qq	-12.8065
▁timr	-12.8066
▁tail	-12.8068
file	-12.8069
times	-12.8075
▁coord	-12.8081
[3].	-12.8082
▁difference	-12.8083
nansw	-12.8088
▁Move	-12.8093
▁Dy	-12.8093
15;	-12.8093
▁9999999999	-12.8095
▁leaf	-12.8097
(26);	-12.81
▁myMap	-12.811
▁(10	-12.8111
nfinall	-12.8115
▁height	-12.8134
nside	-12.8137
hur	-12.8139
maxNum	-12.8168
sPalindrom	-12.817
(5);	-12.8174
nmove	-12.8179
▁sir	-12.8186
7(	-12.8194
▁{"	-12.8202
▁memo	-12.8204
▁appear	-12.8208
▁Sentence	-12.8211
▁bs	-12.8212
ber	-12.8218
▁2.0);	-12.8227
▁ccw	-12.8231
nwrite	-12.8234
▁backward	-12.8251
▁hotels	-12.8258
nMAX	-12.8259
▁"+")	-12.8261
erator	-12.8268
▁convert	-12.8284
▁23;	-12.8285
▁0.5);	-12.8311
▁205	-12.8315
▁maks	-12.8321
▁digits	-12.8331
ndown	-12.8338
▁lines	-12.8341
▁alph	-12.8342
▁binary	-12.8347
▁QAQ	-12.835
▁Set	-12.8351
[--	-12.8366
▁players	-12.8377
▁que	-12.8388
seq	-12.8393
▁mishka	-12.8398
99;	-12.8402
nhit	-12.8403
▁"+"	-12.8404
me	-12.8406
answers	-12.8414
mem	-12.842
▁carry	-12.8421
▁sushu	-12.8429
nmins	-12.8437
▁bad	-12.8441
hang	-12.8452
▁vect	-12.8456
▁Cb	-12.846
/	-12.8463
▁inve	-12.8464
▁command	-12.8465
▁'1'))	-12.847
'+')	-12.8476
-----------	-12.8476
ndig	-12.8501
▁xop	-12.8506
▁3))	-12.8513
bru	-12.8514
44	-12.8523
Ja	-12.8525
▁mie	-12.8525
nSet	-12.853
Total	-12.8561
▁"15	-12.8567
'9'	-12.8571
extra	-12.8578
QAQ	-12.8579
binary	-12.8585
votes	-12.859
locg	-12.8596
▁maxim	-12.8597
larger	-12.8602
cmd	-12.8612
▁run	-12.8626
▁skill	-12.8627
ndone	-12.8638
maks	-12.8638
nys	-12.864
nindx	-12.864
arrent	-12.865
Palindrom	-12.8659
▁tlen	-12.866
▁not	-12.8682
[3]))	-12.8702
>('	-12.8718
suff	-12.8722
▁';	-12.8739
▁bak	-12.8774
▁sumy	-12.8795
▁32);	-12.8834
def	-12.8836
▁update	-12.884
▁J	-12.8842
++];	-12.8867
▁poly	-12.8869
▁sss	-12.8871
▁cond	-12.8898
pref	-12.8901
▁maxcount	-12.8909
▁'!'	-12.8909
▁ymin	-12.8916
Flag	-12.8924
▁10))	-12.8926
nlst	-12.8949
hp	-12.8953
resta	-12.8955
tep	-12.8967
pe	-12.8979
estCases	-12.8981
ending	-12.8984
2002]	-12.8985
pic	-12.899
earch	-12.9002
▁black	-12.9005
▁diag	-12.9033
ZerosOnes	-12.9034
▁"00:00	-12.9034
▁numPairs	-12.9034
PhoneArray	-12.9034
eevee	-12.9034
nuevo	-12.9034
ALPH	-12.9034
spykeId	-12.9034
[5001][5001]	-12.9034
malloc	-12.9034
isp	-12.9034
ogan	-12.9034
reduce	-12.9034
▁ziro	-12.9035
Read	-12.9035
0:0	-12.9036
▁trump	-12.9037
outfile	-12.9037
▁removeZero	-12.9038
Ids	-12.9039
minmum	-12.9042
▁mindis	-12.9042
▁31)	-12.9061
▁4))	-12.907
▁taken	-12.9072
▁rotasi	-12.9075
[1111]	-12.9076
▁numero	-12.9078
▁friends	-12.9091
▁rub	-12.9094
▁turns	-12.9098
maxm	-12.9099
exam	-12.91
▁danik	-12.91
nneg	-12.9111
▁character	-12.9116
)(1	-12.9119
Value	-12.912
1")	-12.9124
▁only	-12.9126
▁cadena	-12.9135
[103]	-12.9141
25.	-12.9146
▁chr	-12.9147
▁loop	-12.9149
rx	-12.9149
▁~	-12.915
String	-12.9153
▁57)	-12.9162
1]++;	-12.9165
record	-12.9166
umm	-12.9175
▁stu	-12.9179
▁maxv	-12.9181
▁wait	-12.9182
▁groups	-12.9185
rec	-12.9188
▁spect	-12.9189
▁marks	-12.9194
▁rd	-12.9199
▁prevlen	-12.9207
▁dragon	-12.9209
kanan	-12.9211
▁maxnum	-12.9212
▁suf	-12.9215
▁ne	-12.9221
nrot	-12.9224
nver	-12.9225
cp	-12.9229
▁80;	-12.9229
ntable	-12.923
njum	-12.9233
bal	-12.9234
▁lzl	-12.9234
[1]][1]	-12.9241
▁arya	-12.9241
▁mole	-12.9249
▁tou	-12.9254
njumlah	-12.9255
▁rate	-12.9256
sup	-12.9257
Pow	-12.9263
lim	-12.9271
XL	-12.9272
nop	-12.9273
▁err	-12.9275
▁csx	-12.9278
dsa	-12.9286
od	-12.9286
▁998244353)	-12.9294
▁liter	-12.9298
▁maps	-12.93
nsteps	-12.9329
ndua	-12.9337
▁lsum	-12.934
▁kkk	-12.9345
uck	-12.9375
▁Map	-12.9391
▁mode	-12.9402
▁qx	-12.9407
▁20000;	-12.9408
nbit	-12.9436
▁cant	-12.9443
▁")";	-12.9444
chat	-12.9457
▁vid	-12.9457
▁vasya	-12.9461
let	-12.9462
nspeed	-12.947
▁nowp	-12.947
▁99999;	-12.9475
ntem	-12.9489
▁14)	-12.949
[32]	-12.95
▁hur	-12.9516
mL	-12.9533
▁zx	-12.9544
▁2][	-12.9547
▁prefix	-12.9574
"6"	-12.9596
nwin	-12.9598
▁andd	-12.9611
▁opt	-12.962
two	-12.9649
nfl	-12.9652
▁""	-12.9663
AQ	-12.9667
fin	-12.9673
▁oy	-12.9685
▁fingers	-12.969
▁900	-12.9697
naa	-12.9712
▁inch	-12.9722
#.#.#.#.#.#.#.	-12.9728
▁cmax	-12.973
De	-12.9738
▁((360	-12.9738
▁10000000000	-12.9764
rows	-12.9772
sylveon	-12.9776
jolteon	-12.9777
leafeon	-12.9778
flareon	-12.9778
glaceon	-12.9779
umbreon	-12.978
▁eat	-12.9782
▁LO	-12.9785
maxy	-12.9789
------------	-12.9798
xgcd	-12.98
▁xb	-12.9812
▁ev	-12.9819
location	-12.982
vasya	-12.9821
"1/6"	-12.9822
crew	-12.9822
Blue	-12.9822
maxSize	-12.9822
nlower	-12.9826
amazing	-12.9836
delta	-12.9845
nsumb	-12.985
convert	-12.985
▁3.1415926535	-12.9855
mins	-12.9855
▁colom	-12.9864
▁999	-12.9868
#.#.#.#.#.	-12.9894
28	-12.9915
nK	-12.9923
▁reverse	-12.9938
▁((3	-12.9942
▁((((	-12.995
(26	-12.995
▁maxr	-12.9955
▁drink	-12.9962
dict	-12.9965
ncpy	-12.9968
▁od	-12.9973
#"	-12.9991
▁201	-12.9992
lt	-12.9998
ount	-13.0006
1])	-13.0012
▁fix	-13.0017
tin	-13.0018
mmin	-13.0028
1[0])	-13.0029
xt	-13.0033
▁per	-13.0052
▁To	-13.0053
▁zsum	-13.0056
▁maxsum	-13.007
nlevel	-13.0072
comp	-13.0076
nmat	-13.0076
▁122	-13.0085
▁ox	-13.0085
▁40;	-13.0103
nms	-13.0105
tree	-13.012
--------------+"	-13.0123
▁62	-13.013
hanges	-13.0148
))))	-13.0157
npoints	-13.0162
Maxn	-13.0167
lah	-13.0169
)]++;	-13.0176
basis	-13.018
Open	-13.0187
ndos	-13.0194
5]	-13.0195
▁':'	-13.0196
▁lat	-13.0213
ndom	-13.022
zeros	-13.0227
▁may	-13.0229
(2.0	-13.0232
ength	-13.0235
xay	-13.0246
stringstream	-13.025
npossible	-13.0254
▁ys	-13.0257
▁an	-13.0257
nvotes	-13.0266
▁1][3]	-13.0272
lastSoldier	-13.0284
▁destination	-13.0284
esPrimo	-13.0284
restaurantsJoys	-13.0284
▁cross	-13.0284
equalto	-13.0284
zheng	-13.0284
▁negro	-13.0284
lIdx	-13.0284
▁blanco	-13.0284
Array	-13.0284
▁tramp	-13.0285
banyakganjil	-13.0285
▁nilai	-13.0285
chance	-13.0285
▁boost	-13.0286
tuple	-13.0286
[5002]	-13.0286
▁minRow	-13.0286
track	-13.0286
▁maxRow	-13.0286
[5050]	-13.0286
▁minCol	-13.0287
▁maxCol	-13.0288
qkids	-13.0288
▁1000005;	-13.029
momo	-13.0293
not	-13.0294
rowCount	-13.03
▁differ	-13.0302
salir	-13.0303
tttt	-13.0304
▁tira	-13.0307
nblocked	-13.0308
MP	-13.0308
nrepeat	-13.0311
▁merge	-13.032
▁99	-13.0322
▁lowest	-13.0324
section	-13.0326
('.'	-13.0328
▁radius	-13.0334
▁killed	-13.0336
▁300;	-13.0343
▁(100	-13.0355
▁xmin	-13.0358
▁isp	-13.0359
